"""[TASK] STASH #36."""

# 1. Что делает команда git stash?
# Команда git stash используется в Git для временного сохранения изменений, которые вы не хотите коммитить в текущий момент, но при этом не хотите их потерять.

# 2. Как просмотреть список всех сохранённых изменений (стэшей)?
# В терменале git stash list
# В клиенте гита -> stash\view stash

# 3. Какая команда применяется для использования верхнего стэша?
# apply latest stash

# 4. Как применить конкретный стэш по его номеру?
# Посмотреть список всех стэшей, выбрать из спика стэш с нужным номером.
# git stash apply "NUMBER_STASH", пишем необходимый номер

# 5. Чем отличается команда git stash apply от git stash pop?
# Команда git stash pop не только восстановит файлы из стэша, но потом удалит этот стэш

# 6. Что делает команда git stash drop?
# Команда git stash drop удаляет стэш без восстановения файлов

# 7. Как полностью очистить все сохранённые стэши?
# Командой в терминале git stash clear

# 8. В каких случаях удобно использовать git stash?
# Стэш необходимо использовать в случаях есть нужно выполнить команды git pull or merge без конфликтов, если есть незакоммиченные файлы

# 9. Что произойдёт, если выполнить git stash pop, но в проекте есть конфликтующие изменения?
# Появится сообщение о конфликте в командной строке, а также файлы, в которых возникли конфликты, будут помечены как конфликтующие (с индексом both modified или подобным). Нужно будет разрешить конфликты вручную.

# 10. Можно ли восстановить удалённый стэш после выполнения git stash drop?
# Стэш обычно невозможно восстановить стандартными средствами Git.

# 11. Что делает команда git stash save "NAME_STASH"
# Команда git stash save "NAME_STASH" позволяет сохранить изменения в стэш с пользовательским названием. В современных версиях Git (начиная с 2.13) рекомендуется использовать команду git stash push.

# 12. Что делает команда
# Команда git stash apply "NUMBER_STASH" используется для применения изменений из стэша определенного номера в текущую рабочую директорию

# 13. Что делает команда git stash pop "NUMBER_STASH"
# Удаляет стэш определенного номера, предварительно восстановив из него файлы

# 14. Сохраните текущие изменения в стэш под названием "SENATOROV ver1", вставьте скриншот из терминала
# ![image.png](attachment:image.png)

# 15. Внесите любые изменения в ваш репозиторий и сохраните второй стэш под именем "SENATOROV ver2"
# ![image.png](attachment:image.png)

# 16. Восстановите ваш стэш "SENATOROV ver1", вставьте скриншот из терминала
# ![image.png](attachment:image.png)

# 17. Удалите все стеши из истории, вставьте скриншот из терминала
# ![image.png](attachment:image.png)
#
