"""Stash."""

# *    Что делает команда git stash?
#
# Сохраняет изменения в рабочей директории "в коробке"/"на полке"/"буфере
# обмена", т.е. в виде, в котором находятся файлы на момент вызова команды для
# возвращения к данной рабочей версии в будущем без потери данных.
#
# *    Как просмотреть список всех сохранённых изменений (стэшей)?
#
# git stash list
#
# *    Какая команда применяется для использования верхнего стэша?
#
# git stash pop/ git stash pop stash@{0} (с удалением файлы из стэша незадолго
# после применения)
#
# или git stash apply/git stash apply stash@{0} (с сохранением данных стэша
# в буфере)
#
# *    Как применить конкретный стэш по его номеру?
#
# Добавить stash@{номер стэша} в конце команды
#
# *    Чем отличается команда git stash apply от git stash pop?
#
# Apply позволяет сохранить стэш на случай работы с несколькими ветками или
# возникновении проблем при применении изменений из стэша в рабочую ветку,
# продолжает держать в буфере данные, в то время как pop применит данные и
# незамедлительно от них избавится
#
# *    Что делает команда git stash drop?
#
# Удаляет определенный стэш
#
# *    Как полностью очистить все сохранённые стэши?
#
# git stash clear
#
# *    В каких случаях удобно использовать git stash?
#
# Если нужно сохранить версию, где изменения коснулись проиндексированных файлов
# или изменения файлов, которые уже отслеживаются гитом (tracked files) 
# Например, во время переключения веток, чтобы избежать конфликтов, перед
# выполнением команды pull для синхронизации с удалённым репозиторием, в
# ситуациях, когда изменения временные и не готовы для фиксации.
#
# *    Что произойдёт, если выполнить git stash pop, но в проекте есть 
# конфликтующие изменения?
#
# Конфликт, нужно выбрать версию для дальнейшей работы или создать новую на
# основе рабочей версии и версии из стэша
#
# *    Можно ли восстановить удалённый стэш после выполнения git stash drop?
#
# Как правило, нет, но возможно, если знаешь номер стэша git stash apply
# $stash_hash или создать отдельную ветку git branch recovered $stash_hash
#
# *    Что делает команда git stash save "NAME_STASH"
#
# Сохраняет стэш отслеживаемых и индексированных файлов с именем стэша
# "NAME_STASH"
#
# *    Что делает команда git stash apply "NUMBER_STASH"
#
# Применяет изменения из стэша с опредеденным номером, не удаляя их
#
# *    Что делает команда git stash pop "NUMBER_STASH"
#
# Применяет изменения из стэша с опред номером, удаляя их. 

# *    Сохраните текущие изменения в стэш под названием "SENATOROV ver1",
# вставьте скриншот из терминала
#
# ![Снимок экрана 2025-02-06 023211.png](<attachment:Снимок экрана 2025-02-06 023211.png>)
#
# *    Внесите любые изменения в ваш репозиторий и сохраните второй стэш под
# именем "SENATOROV ver2"
#
# ![Снимок экрана 2025-02-06 023515.png](<attachment:Снимок экрана 2025-02-06 023515.png>)

# *    Восстановите ваш стэш "SENATOROV ver1", вставьте скриншот из терминала
#
# ![Снимок экрана 2025-02-06 023856.png](<attachment:Снимок экрана 2025-02-06 023856.png>)

# *    Удалите все стеши из истории, вставьте скриншот из терминала
#
# ![Снимок экрана 2025-02-06 024202.png](<attachment:Снимок экрана 2025-02-06 024202.png>)
