"""В этом файле мы будем хранить информацию о пройденных темах и выполненных
заданиях."""

# 30/01/25
# 1. Создание и настройка аккаунтов:
#     - Зарегистрированы и настроены аккаунты на платформах GitHub, Kaggle, ODS.AI и Canva. На GitHub оформлен профиль с использованием шаблонов, на Kaggle получен статус контрибьютора.
#     - В Canva создан джамборд для учебных целей.
# 2. Установка программного обеспечения:
#     - Установлены и настроены программы и библиотеки, необходимые для работы: GitHub Desktop, Cursor, CPython, Git for Windows, Conda.
#     - Проведена проверка настроек ранее установленного VS Code, установлены необходимые плагины для работы.
#
# 3. Работа с Git и GitHub:
#     - Выполнены ключевые действия с Git: поставлена звезда репозиторию, присоединение к команде, создание новой ветки и клонирование репозитория.
#     - Создана и настроена новая ветка для работы, выполнено клонирование репозитория.
#     - Установлена библиотека pre-commit, проведена проверка файлов в репозитории с помощью команды pre-commit run --all-files. Отправлен скриншот терминала с результатами проверки.
#
# 4. Изучение процессов работы с Git:
#     - Ознакомление с процессом создания, отправки и принятия коммитов.
#     - Освоены базовые навыки работы с ветками и репозиториями.
#
# 5. Рекурсия:
#     - Создан данный лог для фиксации выполненных задач.
