"""Файл лога, в котором фиксируются пройденный материал."""

# 27/01/25
#
# 1. Создала аккаунт на GitHub и оформила его, использовав примеры из шаблонов.
# 2. Создала аккаунт на Kaggle и получила статус контрибьютора.
# 3. Создала аккаунт на ODS.AI.
# 4. Скачала и установила GitHub Desktop и Cursor, проверила настройки ранее установленного VS Code.
# 5. Установила плагины, настроила Cursor и VS Code к работе.
# 6. Установила CPython, Git и Conda.
# 7. Создала джамборд для учебы в canva.
# 8. Склонировала репозиторий, присоединилась к команде и создала свою ветку.
# 9. Запустила проверку файлов в репозитории командой pre-commit run --all-files.
# 10. Ознакомилась с процессом принятия и отправки коммитов.

# 27/01/25
#
# 1. Введение в линейную регрессию. 
# 1.1 Метод наименьших квадратов применяется для подбора коэфициентов в линейной регрессии (он оценивает параметры регрессии). 
# 1.2 если данные поддаются линейным взаимосвязям, то мы можем применять линейную модель. 
# 2. Машинное обучение. 2 большие группы - с учителем и без учителя. 
# 2.1 Обучение с учителем: а) регрессионные модели и б) классификационные. 
# 2.2 Без учителя: кластеризация. 
# 3. Рассмотрели порядок обучения модели. 
# 4. Закон нормального распределения. 
# 4.1 Описывает, как часто различные значения случайной величины встречаются в наборе данных. 
# 4.2 Математическое ожидание — это среднее значение случайной величины. 
# 4.3 PDF - график плотности случайной величины. 
# 5. Метод наименьших квадратов (для подбора весов). 
# 5.1 Его задача - минимизировать сумму квадратов регрессионных остатков. 

# 02/02/25
#
# 1. Теорема Гаусса Маркова: МНК является лучшей линейной несмещенной оценкой. 
# 1.1 Несмещенная модель. Суть: когда мы можем взять какое-то подмножество точек из целого множества, и математическое ожидание этого подмножества будет совпадать с таковым у самого множества. 
# 1.2 Гомоскедастичность - свойство, означающее постоянство условной дисперсии вектора или последовательности случайных величин. Означает одинаковый разброс величин относительно нашей линии фита. 
#
# - Как наглядно выглядят гомоскедастичность и гетероскедастичность:
# ![Гетероскедастичность](https://myslide.ru/documents_3/2b677335f0177d29121e558fe4d3215c/img3.jpg)
#
# 2. Математическое ожидание. 
# 3. Понятие дисперсии и стандартного отклонения. Если дисперсия фиксирована и не зависит от входных данных, такая модель называется гомоскедастической регрессией, а если зависит - гетероскедастической. 
# 4. Понятия средняя, медиана и мода. 
# 4.1 Робастная оценка - это и есть медиана, устойчива к выбросам. 
# 4.2 Среднее - сумма всех значений деленная на количество этих значений. 
# 4.2 Медиана - значение, которое делит отсортированный набор на две равные части. 
# 4.3 Мода - значение, которое встречается в выборке чаще всего. 
