"""Файл, в котором я веду заметки о пройденных модулях."""

# # Модуль 1: Введение в математику
#
#
# **Дата:** 12.10.2024
#
# ## Основные моменты урока:
# 1. Определили цель изучения математики.
# 2. Проверили знание школьной математики.
# 3. Скачала PyPy и протестировала работу CPython и PyPy.
#

# # Модуль 2: Урок о математической индукции
#
# **Дата:** 13.10.2024
#
# ## Тема: Математическая индукция
#
# ### Основные моменты урока:
# 1. **База индукции**
# 2. **Индукционный переход**
#

# # Модуль 3: Введение в дифференциальные исчисления
#
# **Дата:** 19.10.2024
#
# ## Тема: Введение в дифференциальные исчисления
#
# ### Основные моменты урока:
# 1. **Понятие числовой последовательности:**
#    1.1. Основные понятия  
#    1.2. Бесконечно малые и бесконечно большие последовательности  
#    1.3. Предел числовой последовательности  
#

# # Модуль, посвященный 4 уроку
# **Дата**: 20.10.24  
# **Тема**: Пределы
#
# ## 1. Повторение прошлой темы
# Б.Б и б.м последовательности, что такое числовая последовательность и предел последовательности.
#
# ## 2. Прорешанные примеры
# Примеры, связанные с темой пределов. Упражнения для закрепления материала.
#
# ## 3. Метод Коши
# Обсуждали метод Коши

# # Модуль 5: Скачивание релизов и работа с GitHub
#
# **Дата:** 26.10.2024
#
# ## Тема: Как скачивать релиз, как создавать issues и pull request
# 1. **Скачивание релиза:**
# 2. **Создание issues:**
#    - Что такое issue и зачем оно нужно.
#    - Как создать новый issue.
#    - Важные элементы: заголовок, описание, метки.
# 3. **Создание pull request:**
#    - Что такое pull request и когда его создавать.
#
#

# ## Модуль, посвященный 6 уроку
# ### 27.10.2024
# #### Предел функции
#
# 1. Определение предела функции по Коши
# 2. Замечательные пределы
# 3. Первый и второй замечательный предел
# 5. Правила Лопиталя
#

# ### Модуль, посвященный 7 уроку
# *02.11.2024*
# 1. Повторили замечательные пределы
# 2. Порядок роста функции
# 3. Метод замены переменной в пределе
#

# ### Модуль, посвященный 8 уроку
# *03.11.24*
# 1. Замечательные эквивалентности в пределах
#     Сравнение б.м функции
# 2. Непрерывность функции. Точки разрыва. Их классификации 
# Как исследовать функцию на непрерывность?
# Односторонние пределы. 
#

# ### Модуль, посвященный 9 уроку
# *09.11.24*
# 1. Повторили понятие непрерывности функции и периодичности функции
# 2. Точки разрыва и их классификация
#     
#     -Односторонние пределы
#     
#     -Точка разрыва первого рода
#

# ### Модуль, посвященный 10 уроку
# *10.11.24*
# 1. Точки разрыва и их классификация 
#     
#     -Точка разрыва первого рода
#
#     -Точки разрыва второго рода
#
#     -Практика
#
#

# ### Модуль, посвященный 11 уроку
# *13.11.24*
# - Числовые ряды

# ## Модуль 12 
# *16.11.24*
# - Прошел экзамен, по пределам

# ### Модуль 13
# *23.11.2024*
#
# - Теория вероятности.
# 1. Совместные и несовместные события.
# Противоположные события. Полная группа событий
# 2. Сложение и умножение событий

# ### Модуль 14
# *24.11.2024*
#
# Комбинаторика
# - Формулы перестановки, сочетания и размещения без повторений
# - Решение задач

# ### Модуль 15
# *30.11.24*
# - Решение задач

# ### Module 16
# *01.12.24*
#
# - Introduction to
#  Probability Theory
#

# ### Module 17
#
# *07.12.24*
#
# - We discussed the further 
# study plan.
