"""В этом файле мы будем вести лог выполненных заданий."""

# 30/01/25
# 1. Создание и настройка аккаунтов:
#     - Зарегистрированы и настроены аккаунты на платформах GitHub, Kaggle, ODS.AI и Canva. На GitHub оформлен профиль с использованием шаблонов, на Kaggle получен статус контрибьютора.
#     - В Canva создан джамборд для учебных целей.
# 2. Установка программного обеспечения:
#     - Установлены и настроены программы и библиотеки, необходимые для работы: GitHub Desktop, Cursor, CPython, Git for Windows, Conda.
#     - Проведена проверка настроек ранее установленного VS Code, установлены необходимые плагины для работы.
#
# 3. Работа с Git и GitHub:
#     - Выполнены ключевые действия с Git: поставлена звезда репозиторию, присоединение к команде, создание новой ветки и клонирование репозитория.
#     - Создана и настроена новая ветка для работы, выполнено клонирование репозитория.
#     - Установлена библиотека pre-commit, проведена проверка файлов в репозитории с помощью команды pre-commit run --all-files. Отправлен скриншот терминала с результатами проверки.
#
# 4. Изучение процессов работы с Git:
#     - Ознакомление с процессом создания, отправки и принятия коммитов.
#     - Освоены базовые навыки работы с ветками и репозиториями.
#
# 5. Рекурсия:
#     - Создан данный лог для фиксации выполненных задач.

# 27/01/25
#
# 1. Введение в линейную регрессию
#     1.1 Метод наименьших квадратов (МНК):
#     Используется для подбора коэффициентов в линейной регрессии. МНК оценивает параметры регрессии, минимизируя сумму квадратов отклонений между предсказанными и фактическими значениями.
#     1.2 Линейные взаимосвязи:
#     Если данные демонстрируют линейные зависимости, линейная модель может быть эффективно применена для анализа и прогнозирования.
#
# 2. Машинное обучение.
#     2.1 Обучение с учителем (Supervised Learning)
#         а. Регрессионные модели:
#         Используются для предсказания непрерывных значений (например, цена дома).
#         б. Классификационные модели:
#         Используются для предсказания категориальных значений (например, определение класса объекта).
#
#     2.2 Обучение без учителя (Unsupervised Learning)
#         - Кластеризация:
#         Методы, которые группируют данные на основе их схожести без использования заранее заданных меток.
#
# 3. Порядок обучения модели.
#
# 4. Закон нормального распределения
#     4.1 Описание:
#     Нормальное распределение описывает, как часто различные значения случайной величины встречаются в наборе данных.
#     4.2 Математическое ожидание:
#     Это среднее значение случайной величины, которое является центром распределения.
#     4.3 PDF (Probability Density Function):
#     График плотности вероятности, который показывает распределение значений случайной величины.
#
# 5. Метод наименьших квадратов (МНК)
#     5.1 Задача МНК:
#     Минимизировать сумму квадратов регрессионных остатков (разница между предсказанными и фактическими значениями).
#     5.2 Применение:
#     Используется для подбора весов (коэффициентов) в линейной регрессии, чтобы модель лучше соответствовала данным.
