"""1 лог занятия."""

#
# 23/11
#
# 1) Изучали, что такое функция
# 2) изучали, что такое множества ( конъюнкция, дизъюнкция, отрицание)
# 3) изучали, что числа ( натуральные, целые, рациональные, иррациональные, действительные)
#

# 30/11
#
# 1. Работали с гитом(исправляли ошибки)
#

# 1/12
# 1. Изучали функции
# 2. domain - область определения функции
# 3. Одному значению x соответсвует одно значение y
# 4. Рассмотрели сюррекцию - одному значению у соответсвует два значения х
# 5. Инъекция - одному из значений у может не соответсвовать х
# 6. Биекция - одному значению у соответсвует одно значение х
#

# 07/12
# 1. Сравнивали программы обучения
# 2. Начали обучаться блок-схемам
#

# 14/12
# 1. Изучали скаляр
# 2. Изучали значение вектора.
# 3. [0,0] -standart position
#

# 21/12
# 1. Проходили вектора
# 2. Транспонирование
# 3. Разлилчие метода и аттрибутов
# 4. Отличие строки от массива
# 5. Подстраивание многомерного массива к одномерному
# 6. Вспомнили правило коммутации, когда а+b = a+b
# 7. Нулевой вектор
# 8. Два представления вектора - алгебраическое и геометрическое
# 9. Умножение на скаляр
# 10. Сложение векторов (голова-хвост)
# 11. Magnitude - длина ветора
#
