"""Module 1.

File log.
"""

# 29/01
#
# 1. Зарегистрировался аккаунты на необходимых платформах
# 2. Скачал и установил программы
# 3. Скачал репозиторий на свой пк
# 4. Обновил ветки в Github Desktop и VSCode
# 5. Создал log.ipynb для отслеживания прогресса

# 27/01/25
#
#     1. Линейная регрессия
#     2. МНК (метод наименьших квадратов)
#     3. ML (Машинное обучение).
#         2.1 Группы с учителем:
#             а. регрессионные модели
#             b. классификационные модели
#         2.2 Без учителя
#     4. Закон нормального распределения (Описание/Математическое ожидание/PDF)

# 02/02/25
#
#     1. Теорема Гаусса Маркова (Несмещенная модель/гомоскедастичность)
#     2. Мат. ожидание
#     3. Дисперсии и стандартное отклонение
#     3. Cредняя, медиана и мода

# 03/02/2025
#
# 1. Задача обучения модели
# 2. Признаки объекта и типы признаков
# 3. Функция потерь
# 4. Градиент и
# 5. Шаг обучения модели (скорость с которой мы хотим обучать модель)
