"""Файл, в котором я веду заметки о пройденных модулях."""

# # Модуль 1: Введение в математику
#
#
# **Дата:** 12.10.2024
#
# ## Основные моменты урока:
# 1. Определили цель изучения математики.
# 2. Проверили знание школьной математики.
# 3. Скачала PyPy и протестировала работу CPython и PyPy.
#

# # Модуль 2: Урок о математической индукции
#
# **Дата:** 13.10.2024
#
# ## Тема: Математическая индукция
#
# ### Основные моменты урока:
# 1. **База индукции**
# 2. **Индукционный переход**
#

# # Модуль 3: Введение в дифференциальные исчисления
#
# **Дата:** 19.10.2024
#
# ## Тема: Введение в дифференциальные исчисления
#
# ### Основные моменты урока:
# 1. **Понятие числовой последовательности:**
#    1.1. Основные понятия
#    1.2. Бесконечно малые и бесконечно большие последовательности
#    1.3. Предел числовой последовательности
#

# # Модуль, посвященный 4 уроку
# **Дата**: 20.10.24
# **Тема**: Пределы
#
# ## 1. Повторение прошлой темы
# Б.Б и б.м последовательности, что такое числовая последовательность и предел последовательности.
#
# ## 2. Прорешанные примеры
# Примеры, связанные с темой пределов. Упражнения для закрепления материала.
#
# ## 3. Метод Коши
# Обсуждали метод Коши

# # Модуль 5: Скачивание релизов и работа с GitHub
#
# **Дата:** 26.10.2024
#
# ## Тема: Как скачивать релиз, как создавать issues и pull request
# 1. **Скачивание релиза:**
# 2. **Создание issues:**
#    - Что такое issue и зачем оно нужно.
#    - Как создать новый issue.
#    - Важные элементы: заголовок, описание, метки.
# 3. **Создание pull request:**
#    - Что такое pull request и когда его создавать.
#
#

# ## Модуль, посвященный 6 уроку
# ### 27.10.2024
# #### Предел функции
#
# 1. Определение предела функции по Коши
# 2. Замечательные пределы
# 3. Первый и второй замечательный предел
# 5. Правила Лопиталя
#

# ### Модуль, посвященный 7 уроку
# *02.11.2024*
# 1. Повторили замечательные пределы
# 2. Порядок роста функции
# 3. Метод замены переменной в пределе
#

# ### Модуль, посвященный 8 уроку
# *03.11.24*
# 1. Замечательные эквивалентности в пределах
#     Сравнение б.м функции
# 2. Непрерывность функции. Точки разрыва. Их классификации
# Как исследовать функцию на непрерывность?
# Односторонние пределы.
#

# ### Модуль, посвященный 9 уроку
# *09.11.24*
# 1. Повторили понятие непрерывности функции и периодичности функции
# 2. Точки разрыва и их классификация
#
#     -Односторонние пределы
#
#     -Точка разрыва первого рода
#

# ### Модуль, посвященный 10 уроку
# *10.11.24*
# 1. Точки разрыва и их классификация
#
#     -Точка разрыва первого рода
#
#     -Точки разрыва второго рода
#
#     -Практика
#
#

# ### Модуль, посвященный 11 уроку
# *13.11.24*
# - Числовые ряды

# ## Модуль 12
# *16.11.24*
# - Прошел экзамен, по пределам

# ### Модуль 13
# *23.11.2024*
#
# - Теория вероятности.
# 1. Совместные и несовместные события.
# Противоположные события. Полная группа событий
# 2. Сложение и умножение событий

# ### Модуль 14
# *24.11.2024*
#
# Комбинаторика
# - Формулы перестановки, сочетания и размещения без повторений
# - Решение задач

# ### Модуль 15
# *30.11.24*
# - Решение задач

# ### Module 16
# *01.12.24*
#
# - Introduction to
#  Probability Theory
#

# ### Module 17
#
# *07.12.24*
#
# - We discussed the further
# study plan

# ### Module 18
# *08.12.24*
# - Introduction to Machine Learning: Supervised and Unsupervised Learning

# ### Module 19
# *09.12.24*
# - We started studying linear regression. 𝑦=𝑘𝑥+𝑏
# - We looked at an example with GDP.

# ### Module 20
# *12.12.24*
# - We plotted 5 data points on a graph and created a linear regression model
#  \( y = \beta_0 + \beta_1 x \), where \( \beta_0 \) and \( \beta_1 \)
#  are the parameters. We also calculated the residuals
#  \( e_1, e_2, ..., e_5 \) as the differences between the actual
#  \( y_i \) values and the predicted \( \hat{y}_i \) values.
#

# ### Module 21
# *17.12.24*
# - We explored MAE and MSE, delving into the topic of errors. We examined the loss function on a graph, discussed the loss function, and considered the global minimum and the point of extremum.

# ### Module 22
# *19.12.24*
#  - Explored the loss function in more detail.

# ### Module 23
# *21.12.24*
# - Covered the concepts of vectors, gradient, and partial derivatives. Examined examples on 3D graphs and discussed the ideas of a local minimum and the antigradient.
#

# ### Module 24 - 25
# *31.12.24*
# - Повторили тему производных(секущая,касательная). Рассмотрели антиградиент,градиент, понятие векторов.
# Рассмотрели тему частных производных

# ### Module 26
# *02.01.25*
# - Повторили тему, функция потерь. Причину по которой нельзя
# брать производную в нуле в MAE

# ### Module 27
# *04.01.25*
# - Создали на питоне дата фрейм,с
# использованием pandas,составили визуализацию
# посчитали y_pred c помощью numpy,matplotlib
#
#

# **Module 28**
#
# *07.01.25*
#
# - Рассмотрели как обойти ошибку с нулем в функции MAE с помощью функции знаков и доопределение функции. Далее перешли в питон и примерили новые методы на практике.

# **Module 29**
#
# *09.01.25*
#
# - В начале урока повторили прошлую тему и вспомнили почему убираем знаменатель.
#
# Что такое Stash?
#  Это удобная функция git, которая помогает сохранить изменения
#   и не потерять их. Stash нужен когда нужно
#    сохранить локальные изменения и принять
#     пулл в удаленного репозитория.Простыми
#     словами последние изменения в локальной
#      директории сохраняются в буфер обмена.

# ![alt text](image.png) - включает неотслеживаемые файлы в stash

# ![alt text](image-1.png) - восстанавливаем последний stash

# ![alt text](image-2.png)  - посмотреть stashs

# ![alt text](image-3.png) - затрекаем временные изменения в коммит

# ### Module 30
# *16.01.25*
# - Посчитали среднее значение w_change и b_change.
# И посчитали b_change

# ### Module 31
# *18.01.25*
# -
