"""1 лог занятия."""

#
# 23/11
#
# 1) Изучали, что такое функция
# 2) изучали, что такое множества ( конъюнкция, дизъюнкция, отрицание)
# 3) изучали, что числа ( натуральные, целые, рациональные, иррациональные, действительные)
#

# 30/11
#
# 1. Работали с гитом(исправляли ошибки)
#

# 1/12
# 1. Изучали функции
# 2. domain - область определения функции
# 3. Одному значению x соответсвует одно значение y
# 4. Рассмотрели сюррекцию - одному значению у соответсвует два значения х
# 5. Инъекция - одному из значений у может не соответсвовать х
# 6. Биекция - одному значению у соответсвует одно значение х
#

# 07/12
# 1. Сравнивали программы обучения
# 2. Начали обучаться блок-схемам
#

# 14/12
# 1. Изучали скаляр
# 2. Изучали значение вектора.
# 3. [0,0] -standart position
#
