"""Логирование уроков."""

# <font size="5">
# 12/01/2025 Линейная алгебра
# </font>
#
# 1. Линейно-векторные подпространства
#
# 2. Охват (span или линейная оболочка)
#
# 3. Эмбеддинговое пространство
#
# 4. Отображение span различных векторов и мерность их подпространства

# <font size="5">
# 09/01/2025 Линейная алгебра
# </font>
#
# 1. Векторное (линейное) пространство и его 8 аксиом
#
# 2. Обозначение векторного пространства в зависимости от операций внутри него
# и особенностей поля
#
# 3. Внутренняя операция (сложение векторов) и внешняя операция (умножение на
# скаляр)
#
# 4. Замкнутость
#
# 5. Пустое множество
#
# 6. Векторные (линейные) подпространства и их свойства

# <font size="5">
# 05/01/2025 Линейная алгебра
# </font>
#
# 1. Понятие алгебраической структуры
#
# 2. Полугруппа и ее аксиомы
#
# 3. Моноид и его аксиомы
#
# 4. Группа и ее аксиомы
#
# 5. Кольцо и его аксиомы
#
# 6. Поле и его аксиомы

# <font size="5">
# 02/01/2025 Линейная алгебра
# </font>
#
# 1. Линейно-взвешенная комбинация
#
# 2. Различие скалярного произведения и линейно-взвешенной комбинации (рез-т)
#
# 3. L1, L2 нормы
#
# 4. Линейная независимость и зависимость
#
# 5. Тривиальное решение и уравнение линейной зависимости
#
# 6. Вектор нулей и его линейная  зависимость
#
# 7. Векторные пространства
#
# 8. Бинарная операция
#
# 9. Коммутативность и ассоциативность алгебраических структур
#
# 10. Единичный элемент и нейтральный элемент

# <font size="5">
# 29/12/2024 Линейная алгебра
# </font>
#
# 1. Понятие ортогональности и орта
#
# 2. Понятие ортогонального разложения
#
# 3. Скалярное произведение ортогональных векторов
#
# 4. Вычисление параллельной компоненты вектора t относительно вектора r
# (математически и на Python)

# <font size="5">
# 24/12/2024 Линейная алгебра
# </font>
#
# Программирование на Python:
#
# 1. Адамарово произведение
#
# 2. Транслирование и внешнее произведение
#
# 3. Скалярное произведение
#
# 4. Алгебраическая и геометрическая интерпретации векторов
#
# 5. Косинусное сходство векторов

# <font size="5">
# 22/12/2024 Linear algebra
# </font>
#
# Python programming:
#
# 1. The norm of vector
#
# 2. A vector to unit vector transformation
#
# 3. Zeros vector to unit vector transformation impossibility
#
# 4. Creation of a vector of any arbitrary magnitude
#
# Dot product as optimization task

# <font size="5">
# 17/12/2024 Linear algebra
# </font>
#
# 1. Dot (scalar) product as inner product special case
#
# 2. Matrix application in Machine Learning
#
# 3. The dot product notation
#
# 4. Dimensionality for dot product
#
# 5. Vector magnitude-squared as the sum of squared elements
#
# 6. Common arithmetic properties, in particular, associative property of the
# dot product
#
# 7. Vector broadcasting
#
# 8. Tensor as multi-dimensional array of numbers

# <font size="5">
# 15/12/2024 Linear algebra
# </font>
#
# 1. Apk-file installation for two-factor authentication
#
# 2. Difference between list and vectors
#
# 3. Radius vector definition
#
# 4. Attribute and method in Python class
#
# 5. Vector addition and subtraction peculiarities (including -1
# multiplication)
#
# 6. Algebraic and geometric vector interpretation
#
# 7. Python scalar-vector multiplication
#
# 8. Range in Python

# <font size="5">
# 10/12/2024 Linear algebra
# </font>
#
# 1. Linear algebra python notebooks copy and pre-commit
#
# 2. Python-code reading. Python function and method definition
#
# 3. Dimensionality and importance of numbers order in vectors
#
# 4. Brackets: square brackets, parentheses etc.
#
# 5. Functions as vector elements
#
# 6. Vector orientation: column and row vectors
#
# 7. Python code difference in list, array without orientation, column vector
# and row vector
#
# 8. Subscription of vector and vector elements
#
# 9. Zero vector
#
# 10. Vector transposition
#
# 11. Commutative vector addition
#
# 12. Two methods of vector subtraction
#
# 13. Important dimensionality condition for addition and subtraction
#
# 14. Vector scaling, turn backwards (flip)
#
# 15. Scalar-vector multiplication
#
# 16. Vector multiplication and division

# <font size="5">
# 08/12/2024 Linear algebra
# </font>
#
# 1. Scalar definition
#
# 2. Vector definition
#
# 3. Coordinate and vector difference
#
# 4. Vector plotting in Python (Math/linear_algebra/vectors_part1)

# <font size="5">
# 05/12/2024 Математический анализ
# </font>
#
# Экзамен
#
# 1. Определение предела последовательности по Коши с геометрическим смыслом
#
# 2. Сходящаяся и расходящаяся последовательность
#
# 3. Осциллирующая последовательность с примерами
#
# 4. Предел функции по Коши с геометрическим смыслом
#
# 5. Бесконечно малая последовательность - ее характеристики и пример
#
# 6. Доказательство по Коши (предел функций и последовательностей)
#
# 7. Что придумал Коши? Вклад Коши в математику
#
# 8. Классификация последовательности и свойства сходящихся последовательностей
#
# 9. Применение производных для избавления от неопределенностей (также y'')
#
# 10. Замечательные пределы и эквивалентности. Четность функций
#
# 11. Реализация метода замены переменной
#
# 12. Отношение функций и их степеней в пределе (бесконечность, 0, k, 1)
#
# 13. Методы избавления от неопределенностей разного вида. Непрерывность
# функции и ее доказательство
#
# 14. Точки разрыва (род и тип)
#
# 15. Два милиционера и геометрический смысл теоремы о последовательностях
#
# 16. Обратная функция - что подставляем и что ищем
#
# 17. Описание свойств функции
#
# 18. Таблица производных
#
# 19. Числовые ряды. Определение, необходимый признак сходимости, достаточный
# признак сходимости. Гармонический ряд и пример расходящегося числового ряда
#
# 20. Простой признак сравнения и предельный признак сравнения числовых рядов
#
# 21. Поиск суммы ряда

# <font size="5">
# 30/11/2024 Математический анализ
# </font>
#
# Тестовый экзамен (некорректные ответы)
#
# 1. Способы задания последовательностей
#
# 2. Определение предела последовательности по Коши
#
# 3. Доказательство предела последовательности по Коши
#
# 4. Вероятность стремления последовательности к минус бесконечности
#
# 5. Классификация неопределенностей как шаг нахождения предела функции
#
# 6. Применение Лопиталя для нахождения предела функции
#
# 7. Таблица производных
#
# 8. Свойства сходящихся последовательностей
#
# 9. Классификация последовательностей по значениям
#
# 10. Соотношение области определения и области значения функции
#
# 11. Характеристика функции
#
# 12. Симметричность функции по оси ординат
#
# 13. Функция Дирихле
#
# 14. Замечательные пределы при х -> 0
#
# 15. Замена переменной
#
# 16. Точки разрыва функции
#
# 17. Определение числового ряда

# <font size="5">
# 26/11/2024 Математический анализ
# </font>
#
# 1. Числовые ряды - основные понятия
#
# 2. Достаточный признак сходимости/расходимости ряда
#
# 3. Предельный признак сравнения числовых положительных рядов
#
# 4. Вычисление суммы ряда с использованием формулы суммы геометрической
# прогрессии
#

# <font size="5">
# 23/11/2024 Математический анализ
# </font>
#
# 1. Необходимый признак сходимости ряда
#
# 2. Гармонический числовой ряд и условия его сходимости и расходимости
#
# 3. Простой признак сравнения положительных числовых рядов
#
# 4. Сравнение числовых рядов с гармоническим рядом (сходящийся an <= bn/
# расходящийся an >= bn)

# <font size="5">
# 19/11/2024 Математический анализ
# </font>
#
# 1. Понятие числового ряда
#
# 2. Сходимость и расходимость числовых рядов
#
# 3. Осциллирующий числовой ряд (суммы не существует)
#
# 4. Геометрическая убывающая прогрессия
#
# 5. Необходимый признак сходимости ряда
#
# 6. Расхождение ряда при большей или равной степени многочлена в числителе,
# чем в знаменателе
#
# 7. Гармонический ряд и его расхождение

# <font size="5">
# 17/11/2024 Математический анализ
# </font>
#
# 1. Повторение эквивалентных функций
#
# 2. Геометрическое значение первого замечательного предела
#
# 3. Непрерывность функций в точке и на интервале
#
# 4. Точки разрыва и их классификация (1 и 2 род)
#
# 5. 3 условия непрерывности функции в точке

# <font size="5">
# 13/11/2024 Математический анализ
# </font>
#
# 1. Ознакомление с требованиями к экзамену
#
# 2. Эквивалентности функций в пределах
#
# 3. Эквивалентности бесконечно малых тригонометрических функций

# <font size="5">
# 06/11/2024 Математический анализ
# </font>
#
# 1. Создание форка в Git
#
# 2. Замечательные эквивалентности - объяснение определения через геометрию
#
# 3. Понимание характера функций через ее формулу (sinx, x+2)
#
# 4. Бесконечный ряд Тейлора как функция синуса

# <font size="5">
# 02/11/2024
# </font>
#
# Установка Linux

# <font size="5">
# 30/10/2024 Математический анализ
# </font>
#
# 1. Порядок роста функции.Сравнение бесконечно больших функций:
#
#     1) Когда функция в числителе большего порядка, чем в знаменателе
#
#     2) Когда функция в знаменателе большего порядка, чем в числителе
#
#     3) Когда функции эквивалентны на бесконечности (одинакового порядка в
#     числителе и знаменателе)
#
# 2. Метод замены переменной в пределе
#
# 3. Устранение неопределённости «единица в степени бесконечность»
#
# 4. Бесконечно малые функции в конкретной точке
#
# 5. Сравнение бесконечно малых функций (отброс переменных больших порядков)
#
# 6. Эквивалентность функций
#
# 7. Замечательные пределы (геометрическое трактование)
#
# 8. Замечательные эквивалентности в пределах (бесконечно малой функции)

# <font size="5">
# 27/10/2024 Математический анализ
# </font>
#
# <b>Предел функции и последовательности</b>
#
# 1. Повторение определения предела последовательности по Коши (стр. 6-7)
#
# 2. Повторение определения предела функции по Коши (стр. 23-24)
#
# 3. Правила Лопиталя и возможность их использования
#
# 4. Первый замечательный предел
#
# 5. Второй замечательный предел
#
# <b>Неопределённости.
# Порядок роста функции. Метод замены</b>
#
# 1. Метод замены переменной в пределе
#
# 2. Устранение неопределённости «единица в степени бесконечность» по формуле
#
# 3. Разновидности неопределенности
#
# 4. Порядок роста функции (скорость изменения функции)
#
# 5. Правило роста степенной функции с произвольным ненулевым коэффициентом.
# Отношение скорости роста кубической, квадратичной, линейной и суммы линейной
# и квадратичной функций

# <font size="5">
# 23/10/2024 Математический анализ
# </font>
#
# <b>Предел функции</b>
#
# 1. Алгоритм работы с issues и pull request. Синхронизация форков
#
# 2. Различие предела функции и предела последовательности
#
# 3. Определение предела функции по Коши (по определению)
#
# 4. Решение примеров на пределы функции (деление на макс. степень, метод
# умножения числителя и знаменателя на сопряженное выражение, преобразование)
#
# 5. Правила Лопиталя
#
# 1) Первое правило
#
# 2) Второе правило
#
# Производные
#
# ![image.png](attachment:image.png)

# <font size="5">
# 20/10/2024 Математический анализ
# </font>
#
# <b>Числовая последовательность</b>
#
# 1. Определение Епсилон и Епсилон-окрестности
#
# Епсилон - это число очень маленькое, которое приближается к 0. Подбирается к
# задаче
#
# Епсилон-окрестность -  это такое множество, каждая точка которого удалена от
# данного множества менее, чем на ε
#
# 2. Осциллирующая последовательность
#
# Последовательность, у которой значения принимают то отрицательные, то
# положительные числа
#
# ![image.png](attachment:image.png)
#
# ![image-2.png](attachment:image-2.png)
#
# 3. Определение предела по Коши
#
# ![image-3.png](attachment:image-3.png)
#
# Сначала выбираем Епсилон-окрестность, поэтому N зависит от Епсилон

# 4. Теорема Больцано-Вейерштрасса
#
# Из любой ограниченной последовательности можно выделить сходящуюся (в одной
# точке) подпоследовательность
#
# 5. Бесконечно малые и бесконечно большие последовательности
#
# ![image.png](attachment:image.png)
#
# 6. Свойства бесконечно малых последовательностей
#
# ![image-2.png](attachment:image-2.png)
#
# 7. Геометрический смысл предела последовательностей
#
# ![image-3.png](attachment:image-3.png)
#
# 8. Основные свойства сходящихся последовательностей
#
# ![image-4.png](attachment:image-4.png)
#
# 9. Алгоритм определения предела последовательности
#
# 1) Классификация, подставляем значение n
#
# 2) Раскрытие неопределенности, делим на старший член (максимальную степень) n
#
# 3) Повторная классификация
#
# 4) Если не бесконечность, то применяем свойства из 8 пункта

# <font size="5">
# 16/10/2024 Математический анализ
# </font>
#
#
# <b>Введение в дифференциальное и интегральное исчисление. Функция одной
# переменной</b>
#
# 1. Числовая последовательность. Определение
#
# Числовая последовательность - это задание каждому натуральному числу n по
# некоторому правилу соответствующего действительного числа xn
#
# 2. Классификация задания последовательности
#
#     2 типа задания последовательности:
#
#     1) Формула общего члена
#
#     2) Рекуррентная формула
#
# 3. Элементы последовательности
#
#     n - номер элемента
#
#     Общий член Xn
#
#     Элементы последовательности Х1,Х2,Х3...
#
# 4. Сокращенная запись последовательности
#
# {Xn}
#
# 5. Геометрическое выражение последовательности
#
# ![image.png](attachment:image.png)
#
# 6. Классификация последовательностей по значению элементов
#
#     1) Постоянная
#
#     2) Ограниченная
#
#     3) Неограниченная
#
# 7. Как найти пределы последовательности
#
# ![image-2.png](attachment:image-2.png)
#
#
#

# Епсилон-окрестность -  это такое множество, каждая точка которого удалена от
# данного множества менее, чем на ε.
#
# a - предел, ε - епсилон-окрестность
#
# ![image.png](attachment:image.png)
#

# <font size="5">
# 13/10/2024 Математический анализ
# </font>
#
#
# <b>Числовая последовательность. Введение в дифференциально-интегральное
# исчисление</b>
#
# 1. Определение числовой последовательности
#
# Последовательность – это когда что-то расположено за чем-то. Члены
# последовательности располагаются строго в определённом порядке.
#
# ![image.png](attachment:image.png)
#
# ![image-2.png](attachment:image-2.png)

# 2. Элементы (члены) последовательности
#
# Общий член последовательности - запись числа последовательности в общем виде
#
# ![image-2.png](attachment:image-2.png)

# 3. Рекуррентная последовательность
#
# Последовательность, значение каждого члена которой зависит от значений ее
# предыдущих членов
#
# ![image.png](attachment:image.png)

# 4. Виды последовательностей
# 1) Постоянная
# 2) Ограниченная (где n принадлежит N)
# 3) Неограниченная
#
# ![image.png](attachment:image.png)

# 5. Операции с последовательностями
#
# - сумма последовательностей
#
# - разность последовательностей
#
# - произведение последовательностей/последовательности и числа
#
# - частное последовательностей
#
#

# <font size="5">
# 09/10/2024 Математический анализ
# </font>
#
#
# <b>Математическая индукция</b> - метод доказательства утверждения
#
# Пример
#
#
# ![GetImage.png](attachment:GetImage.png)
#
# Этапы:
#
# 1) База
#
# База = 1, значит, берется первый элемент слева
# База = 2, два элемента слева берутся
#
# Если за каждым верным утверждением следует следующее верное утверждение, то
# мы можем применять математическую индукцию
#
# 2) Индукционный переход
#
# Доказательство, что если формула верна при n=k, то она верна и при n=k+1
# и для любого другого n
#
#
# Разложение квадратного трехчлена
#
# ![GetImage.jpeg](attachment:GetImage.jpeg)
#

# <font size="5">
# 06/10/2024
# </font>
#
# 1. Комплексные числа
#     Числа вида a+bi (состоят из вещественной части a и мнимое части bi,
#     где b - вещественное число, i - мнимая единица являющаяся корнем из -1)
#
# 2. Отношение множеств с множествами
#
#     Квантор вхождения (эквивалентен <), например, N ⊂ Z (= "является
#     подмножеством")
#
#     Квантор включения (эквивалентен <=), например, N ⊆ N (= "каждый элемент
#     множества N также является элементом N")
#
# 3. Отношение множеств с элементами
#
#     Квантор принадлежности, например, 1∈N (= "1 принадлежит множеству N")
#
# 4. Операции над множествами
#     Объединение
#
#     Пересечение
#
#     Разность
#
#     Симметричная разность
#
#     Дополнение множества A (= отрицание множества B) ("A'")
#
#
# ![image.png](attachment:image.png)
#
#
# 5. Операции над элементами
#
#     Вычитание - частный случай сложения
#
#     Деление - частный случай умножения
#
# 6. Периодическая дробь

# <font size="5">
# 18/09/2024
# </font>
#
# 1. Тестирование уровня знаний
# 2. Различия математики для DA и DS
# 3. Классификация чисел: N - натуральные, Z- целые, Q - рациональные, I -
# иррациональные, R - вещественные
# 4. Диаграмма Эйлера-Венна для работы со множеством
# 5. Кванторы
#
