"""Файл лога, в котором фиксируются пройденный материал."""

# 27/01/25
#
# 1. Создала аккаунт на GitHub и оформила его, использовав примеры из шаблонов.
# 2. Создала аккаунт на Kaggle и получила статус контрибьютора.
# 3. Создала аккаунт на ODS.AI.
# 4. Скачала и установила GitHub Desktop и Cursor, проверила настройки ранее установленного VS Code.
# 5. Установила плагины, настроила Cursor и VS Code к работе.
# 6. Установила CPython, Git и Conda.
# 7. Создала джамборд для учебы в canva.
# 8. Склонировала репозиторий, присоединилась к команде и создала свою ветку.
# 9. Запустила проверку файлов в репозитории командой pre-commit run --all-files.
# 10. Ознакомилась с процессом принятия и отправки коммитов.

# 27/01/25
#
# 1. Введение в линейную регрессию.
# 1.1 Метод наименьших квадратов применяется для подбора коэфициентов в линейной регрессии (он оценивает параметры регрессии).
# 1.2 если данные поддаются линейным взаимосвязям, то мы можем применять линейную модель.
# 2. Машинное обучение. 2 большие группы - с учителем и без учителя.
# 2.1 Обучение с учителем: а) регрессионные модели и б) классификационные.
# 2.2 Без учителя: кластеризация.
# 3. Рассмотрели порядок обучения модели.
# 4. Закон нормального распределения.
# 4.1 Описывает, как часто различные значения случайной величины встречаются в наборе данных.
# 4.2 Математическое ожидание — это среднее значение случайной величины.
# 4.3 PDF - график плотности случайной величины.
# 5. Метод наименьших квадратов (для подбора весов).
# 5.1 Его задача - минимизировать сумму квадратов регрессионных остатков.
