"""Логгирование уроков."""

# 11.02.25
#
# 1. Выполнена настройка рабочего окружения
# 2. Изучена работа с Git
# 3. Сделан первый коммит

# 12.02.25
# 1. Знакомство, поределение целей курса
# 2. Погружение в линейную алгебру:
# 2.1 Рассмотрена модель линейной регрессии с одной независимой переменной
# 2.2 Рассмотрена что такое нормальное распредление
# 2.3 Рассмотрены два основных параметра: угловой коэффициент и свободный член
# 2.4 Изучено что аткое случайный гауссовский шум
# 3.  Расмотрен порядок построения модели

# 02.04.25
# 1. Рассмотрены понятия эмпирический коэффициент детерминации, рассмотрена формула рассчета  эмпирического коэффициент детерминации
# 2. Рассмотрена разница между межгрупповой дисперсией и общей дисперсией
# 3. Посчитан на примере эмпирический коэффициент детерминации
