"""Этот модуль предназначен для ведения отчётов по пройденным темам."""

# 04/11
# 1. Разобрали понятие множеств.
# 2. Рассмотрели различные виды последовательностей.
# 3. Обсудили определение последовательности.

# 06/11
# 1. Обозначили вклад в мат.анализ Коши
# 2. Вспомнили про рекуррентный и общий способы задания последовательностей
# 3. Разобрали доказательство в кванторах
# 4. Нарисовали окрестности для последовательностей, и подобрали для них
# особое число N

# 11/11
# 1. Повторили особенности последовательностей.
# 2. Вспомнили про рекуррентный и общий способы задания последовательностей.
# 3. Вспомнили алгебраические операции.
# 4. Разобрали метод математической индукции на примере уравнения.
# 5. Разложили уравнение на квадратный трёхчлен.

# 13/11
# 1. Повторили способ доказательства мате индукции.
# 2. Порешали пределы.
# 3. Вспомнили свойства пределов.
# 4. Вспомнили что такое функция.
# 5. Обсудили различия в понятиях вхождения, включения и эквивалентности.

# 19/11
# 1. Сделали обзор на курсор.
# 2. Обсудили требования по экзамену.
# 3. Обратились за помощью к ds_fighter
# 4. Построили план по выполнению заданий.

# 21/11
# 1. Проговорили определение предела функции в точке по Коши.
# 2. Решили пример по определению.
# 3. Обсудили свойства функций.

# 25/11
# 1. Повторили определение функции в точке по Коши.
# 2. Обсудили доп.задание на гитхабе.
# 3. Решили несколько примеров пределов.

# 28/11
# 1. Решили примеры методом Лопиталя.
# 2. Поговорили про порядок роста функции.
# 3. Решили примеры на определение порядка роста функций.
# 4. Поговорили про метод замены.

# 10/12
# 1. Обсудили introduction
# 2. Вспомнили порядок роста функции.
# 3. Вспомнили про знак Ландау и его определение как более высокий порядок роста функции.
# 4. Решили пример методом замены.
