# +


"""Chapter 1 notes for Made Easy book."""


#
# ### Что такое Data Science?
#
# **Данные** это серый кардинал. Сегодня данные правят миром, товары в рекомендациях, социальные опросы, лучший маршрут без пробок, прогноз котировок. Все они используют анализ данных.
#
# **Data Science** - наука об изучении данных, для извлечения полезной информации при помощи различных научных методов, алгоритмов и процессов.
#
#
#

#
# #### Зачем нам Data Science?
#
# **Data Science** - наука изучающая данные, помогает принять наиболее правильные решения, обнаруживать закономерности, выполнять анализ и визуализировать данные. Эта наука необходима для:
#
# * Задавать правильные вопросы
# * Находить закономерности
# * Визуализировать результат анализа
# * Наделять машины интеллектом
# * Принимать более качественные и быстрые решения
#
#

#
# #### Ключевые даты развития Data Science.
#
# * **1663 год** - первый статистический анализ данных ученым Джоном Граунтом.
# * **1865 год** - появление термина **бизнес-аналитика**, Ричард Миллар.
# * **1880 год** - создание **Табулирущей машины Холлерита**, сокращение времени обработки данных с 10 лет до трех месяцев. Далее компания будет называться IBM.
# * **1991 год** - создание Интернета, Тим Бернерс-Ли.
# * **1997 год** - появление сервиса Google.
# * **2000 год** - появление языка Python 2.0
#
#

#
# #### Настоящее и будущее Data Science
#
# Сегодня развитие Data Science идет по нескольким веткам.
#
# * **`Искуственный интелект`** - сфера создания интеллектуальных машин, способных работать и принимать решения как человек. Исследования в этой области начались в 1936 г., Алан Тьюринг создал первые машины на базе ИИ.
#
# * **`Машинное обучение`** - создание различных моделей, об**учение с учителем и** обучение без учителя.
#
# * **`Глубокое обучение`** - создание многослойной нейросети, наличие более одного скрытого слоя нейронов в сети, которые проводят математические вычесления.

#
# #### Специалист по Data Science.
#
# ***«Специалист по Data Science - это человек, который разбирается в статистике
# лучше любого программиста и программирует лучше любого статистика» (Джош
# Уиллс).***
#
# Специалист по Data Science анализирует бизнес-данные, извлекая из них важную
# информацию. Другими словами, специалист по анализу данных решает бизнес­
# задачи такие как:
#
# * Обноружение мошеничества и выявление аномалий
# * Целевой маркетинг
# * Метрические прогнозы
# * Прогнозирующее моделирование
#
# ##### Какие навыки необходимы ?
#
# * Программирование
# * Статистика
# * Базы данных
# * Моделирование
#
# ##### Профессии в области Data Science.
#
# * Специалист по данным
# * Дата-инженер
# * Аналитик данных
# * Статистик
# * Архитектор данных
# * Администратор данных
# * Бизнес-аналитик
# * Менеджер данных/аналитики
#
#
#
#

#
# #### Основы компьютерного программирования
#
# Программирование это общение с компьюетером, пошаговые инструкции, понятные компьютеру.
#
# Пошаговые инструкции называются **алгортимом**.
#
# **Алгоритм** - последовательность четко определенных действий.
#
# Чем проще и оптимальнее алгоритм тем лучше и быстрее результат.
#
# Алгоритмы состоят из 3 видов операторов.
#
# 1. Последовательные операторы.
# 2. Условные операторы.
# 3. Циклы или итерации.
#
# * **Последовательные операторы** - выполняются один за другим, последовательно.
# * **Условные операторы** - выполняются в зависимости от определеннго условия.
# * **Циклы или итерации** - определенный набор действий выполняется снова и снова в зависимости от некоторого условия.
#
#
# ##### Языки программирования
#
# Существует огромное количество языков программирования, по аналогии с разговорными языками, у всех языков программирования есть свои сильные и слабые стороны в зависимости от задач.
#
# Компьютер понимает только **машинный язык**, языки программирования созданы что бы человек мог взаимодействовать с машиной.
#
# Все языки программирования являются **языками выского уровня**
#
#
# ##### Исходный код
#
# Исходный код - то что пишут программисты на всех языках программирования. Исходный код не может содержать разметки и форматирования.
#
# Что бы машина понимала исходный код необходимо перевести код на понятный для машины язык. Для этого в помощь нам приходят такие понятия как ***компиляция*** и ***интерпретация***
#
# **Компилятор** - это прогармма, преобразующая исходный код в машинный. Комплияция языка программирования высокго уровня на машинный язык.
#
# **Интерпретатор** - это программа которая преобразует исходный код в машинный при помощи построчного чтения кода, при каждом запуске исходного кода.
#
# ***Наш любимый Python использует комбинацию обоих методов.***
#
#
# ##### Среда разработки IDE
#
# **IDE** - lntegrated Development Environrnent - среда разработки, специальное программное обеспечение для написания компьютерных программ.
#
# В нашем случае мы используем `VsCode` в качестве IDE.
#
#
#
#
#

#
# #### Упражнения
#
# ##### Ответьте на вопросы
#
#
# ***Какие предметные области входят в Data Science? Что между ними общего и в чем различие?***
#
# * ИИ - создание искуственного интелекта, которое может сравниться с человеческим мозгом.
# * Машинное обучение - создание моделей на основе данных.
# * Глубокое обучение - создание многослойных нейросетей для быстрого анализа данных.
# * Большие данные - работа с огромными объемами данных.
#
# Взаимосвзять между ними заключается в том что все они работают и анализируют данные.
#
#
# ***Как вы понимаете термин «алгоритм»? Как алгоритмы связаны с блок-схемами?***
#
# Алгоритм - это пошаговые действия для достижения определенного результата. Блок - схемы это визуальное отображение алогоритма.
#
#
# ***Какую программу можно назвать хорошей? Запишите все характеристики, какие удастся придумат***
#
# Как мне кажется программа должна быть:
# * Читаемой
# * Кушать мало памяти
# * Быть быстрой
#
#
# ***Какой язык понимает компьютер?***
#
# Машинный язык - 10101010101
#
#
# ***Чем языки программирования отличаются от языков, на которых мы говорим?***
#
# По сути ничем, языки программирования используют такие же слова которые понятны нам, но в очень коротком виде. Языки программирования были приудманы льдьми для людей, ну и конечно же что бы мы могли давать команды машине.
#
#
#
# #####  Правда или ложь
#
# 1. Правда
# 2. Ложь
# 3. Ложь
# 4. Правда
# 5. Ложь
# 6. Ложь
# 7. Правда
# 8. Ложь
# 9. Правда
# 10. Ложь
#
#
#
# #####  Практические задания
#
#
# `Напишите алгоритм для расчета простых процентов от некоторой суммы.`
#
# * Начало
# * Введите данные: процент, сумма
# * Вычесление: сумму уможножить на процент
# * Результат: записать результат
# * Вывести результат
# * Конец
#
# `Напишите алгоритм для вычисления площади прямоугольника. `
#
# * Начало
# * Ввод данных: Длина, Ширина
# * Вычислить: Длина умножить Ширина
# * Вывести результат вычисления
# * Конец
#
# `Напишите алгоритм вычисления периметра круга`
#
# * Начало
# * Ввод данных: радиус, число Pi
# * Вычисление: 2 умножить  Pi умножить радиус
# * Вывести результат вычисления
# * Конец
#
# `Напишите алгоритм превращения предложения, написанного в верхнем регист­ре, в обычный для предложений регистр.`
#
# * Начало
# * Ввод данных: ваше предложение
# * Вычисление: первая буква первого слова в верхнем регистре плюс остальной текст в нижнем регистре
# * Вывести результат вычисления
# * Конец
#
#
#
#
