"""chapter_2_introduction_to_python."""

# ### Что такое Python?
# <p>Python - это бесплатный интерпретируемый высокоуровневый язык программирования общего назначения с открытым исходным кодом. Он был создан Гвидо ван Россумом в 1991 г.</p>
#
# <p>Критерии выбора языка: популярность среди программистов и среди работодателей, простой в изучении и использовании, имеет открытый код, большой набор бибилиотек, инструментов и фреймворков. </p>
#
# <p>История появления Python.</p>
#
# <p>Стартовые характеристики Python:</p>
# <p>- идеален для автоматизации рутины,примением к большому длиапазону задач;</p>
# <p>- прост в использовании. доступен во всех операционных системах;</p>
# <p>- реализовано много проверок ошибок;</p>
# <p>- позволяет разделять программу на модули, которые можно использовать неоднократно;</p>
# <p>- имеет большой втсроенный набор стандартных модулей;</p>
# <p>- интерпретируемый язык, что позволяет быстро тестировать прорамму;</p>
# <p>- программы компактны и читабельны: имеет встроенные высокоуровненевые типы данных, в результате можно записать сложные операции в одну строку, группировка операторов осуществляется с помощью отступов, объявление переменных или аргументов не требуется;</p>
# <p>- является расширяемым. </p>
#
# **Философия Python.**
# <p>Zen of Python:
# <p>- Красивое лучше, чем уродливое.
# <p>- Явное лучше, чем неявное.
# <p>- Простое оучше, чем сложное.
# <p>- Сложное лучше, чем запутанное.
# <p>- Читаемость имеет значение.</p>

# ### Преимущества Python по сравнению с другими языками.
# <p>Простота.</p>
# <p>Легкость в изучении.</p>
# <p>Свободный и открытытй код.</p>
# <p></p>
#

#
