"""Команда git stash.

Ответы на вопросы из issue.
"""

# ## Список вопросов и ответов:
#
# 1. Что делает команда git stash?
# 2. Как просмотреть список всех сохранённых изменений (стэшей)?
# 3. Какая команда применяется для использования верхнего стэша?
# 4. Как применить конкретный стэш по его номеру?
# 5. Чем отличается команда git stash apply от git stash pop?
# 6. Что делает команда git stash drop?
# 7. Как полностью очистить все сохранённые стэши?
# 8. В каких случаях удобно использовать git stash?
# 9. Что произойдёт, если выполнить git stash pop, но в проекте есть конфликтующие изменения?
# 10. Можно ли восстановить удалённый стэш после выполнения git stash drop?
# 11. Что делает команда git stash save "NAME_STASH"
# 12. Что делает команда git stash apply "NUMBER_STASH"
# 13. Что делает команда git stash pop "NUMBER_STASH"
# 14. Сохраните текущие изменения в стэш под названием "SENATOROV ver1", вставьте скриншот из терминала
# 15. Внесите любые изменения в ваш репозиторий и сохраните второй стэш под именем "SENATOROV ver2"
# 16. Восстановите ваш стэш "SENATOROV ver1", вставьте скриншот из терминала
# 17. Удалите все стеши из истории, вставьте скриншот из терминала
