"""Команда git stash.

Ответы на вопросы из issue.
"""

# ## Список вопросов и ответов:
#
# 1. Что делает команда git stash?
#
#   Команда git stash сохраняет наши изменения в файле во временное хранилище, если мы пока не готовы их коммитить. Стеш можно создавать командой git stash столько раз, сколько нам необходимо.
#  - git stash по дефолту отправляет в стэш только:
#    1. Изменения в файлах, которые уже отслеживаются Git: Файлы, которые были изменены, но еще не закоммичены, будут сохранены в стэш.
#    2. Добавленные, но не закоммиченные файлы (staged files): Файлы, которые были добавлены в индекс с помощью git add, но еще не закоммичены, также будут сохранены в стэш.
#  - git stash -u - для сохранения в стэш в том числе неотслеживаемых файлов.
#  - git stash -a - для сохранения в стэш в том числе игнорируемых файлов.
#
# 2. Как просмотреть список всех сохранённых изменений (стэшей)?
#
#   Командой git stash list
#
# 3. Какая команда применяется для использования верхнего стэша?
#
#   git stash pop или git stash pop stash@{0}
#
# 4. Как применить конкретный стэш по его номеру?
#
#   git stash pop stash@{n}, где n - это номер конкретного стэша.
#
# 5. Чем отличается команда git stash apply от git stash pop?
#
#   Обе команды применяют  изменения из стэша к рабочей директории. Но git stash apply при этом не удаляет их из стэша, в то время как git stash pop - удаляет.
#
# 6. Что делает команда git stash drop?
#
#  - git stash drop удаляет последний сохраненный стэш.
#  - git stash drop stash@{n} удаляет конкретный стэш.
#
# 7. Как полностью очистить все сохранённые стэши?
#
#   git stash clear
#
# 8. В каких случаях удобно использовать git stash?
#
#   Если нам необходимо принять изменения в свою ветку из гитхаба, чтобы не возникло конфликтов. Или если нам необходимо временно переключиться на другую ветку, но мы не готовы закоммитить наши изменения. В обоих случаях мы помещаем наши незакоммиченные изменения в стэш.
#
# 9. Что произойдёт, если выполнить git stash pop, но в проекте есть конфликтующие изменения?
#
#   Git попытается применить наши сохраненные изменения из стэша к текущей рабочей директории. Если будут конфликты, он сообщит нам об этом и покажет в каких файлах они произошли. Тогда нужно будет с помощью кнопок Accept или вручную выбрать, какие изменения мы хотим оставить.
#
# 10. Можно ли восстановить удалённый стэш после выполнения git stash drop?
#
# Восстановление удаленного стэша после выполнения команды git stash drop возможно. Git не предоставляет встроенного способа для восстановления удаленного стэша, но существуют обходные пути. Пошагово:
#
#   1. git reflog - для просмотра лога ссылок, который включает все изменения ссылок в репозитории, включая удаленные стэши.
#   2. В выводе команды найти запись, соответствующую удаленному стэшу. Она будет выглядеть примерно так: d47e5c3 HEAD@{0}: stash: WIP on main: <какое-то сообщение>.
#   3. Использовать найденный хэш коммита для восстановления стэша: git checkout -b temp d47e5c3.
#   4. Потом создать новый стэш из текущего состояния ветки temp командой git stash.
#   5. Потом можно вернуться к основной ветке и удалить временную:
#    - git checkout main
#    - git branch -D temp
#
# 11. Что делает команда git stash save "NAME_STASH"
#
#   Сохраняет стэш с нашим описанием "NAME_STASH", чтобы мы могли лучше ориентироваться с списке наших стэшей.
#
# 12. Что делает команда git stash apply "NUMBER_STASH"
#
#   Применяет конкретный стэш к рабочей копии проекта, но не удаляет сам стэш из списка стэшей.
#
# 13. Что делает команда git stash pop "NUMBER_STASH"
#
#   То же самое, что и git stash apply "NUMBER_STASH", только этот стэш будет удален из списка стэшей.
#
# 14. Сохраните текущие изменения в стэш под названием "SENATOROV ver1", вставьте скриншот из терминала
#
# ![SENATOROV_ver1](./screenshots/SENETOROVver1.png)
#
# 15. Внесите любые изменения в ваш репозиторий и сохраните второй стэш под именем "SENATOROV ver2"
#
# ![SENATOROV_ver2](./screenshots/SENATOROVver2.png)
#
# 16. Восстановите ваш стэш "SENATOROV ver1", вставьте скриншот из терминала
#
# ![apply_stash](./screenshots/apply_stash.png)
#
# 17. Удалите все стеши из истории, вставьте скриншот из терминала
#
# ![clear](./screenshots/clear.png)
