"""Opensource."""

# ## Questions
#
# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
# 2. Напишите название понравившейся компании и ссылку на репозиторий
# 3. Проект активно принимает стороннюю помощь?
# 4. Напишите второе улучшение которое вы сделали
# 5. Посмотрите на коммиты в основной ветке, напишите общее количество
# 6. Когда был последний коммит?
# 7. Сколько контрибьюторов у проекта?
# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
# 9. Сколько сейчас открытых ишью?
# 10. Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
# 11. Ведётся ли активное обсуждение ишью?
# 12. Есть ли недавно созданные ишью?
# 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
# 14. Сколько сейчас открытых пул-реквестов?
# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
# 16. Ведётся ли активное обсуждение пул-реквестов?
# 17. Есть ли недавно отправленные пул-реквесты?
# 18. Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)

# ## Answers
#
# 1. no
# 2. Codeacamedy, https://github.com/Codecademy/docs
# 3. yes
# 4. Added a new term entry
# 5. 6787
# 6. 4 hours ago
# 7. 1119
# 8. every day
# 9. 50
# 10. less then 3 days
# 11. it depends on the issue time, in general, yes
# 12. yes
# 13. yes
# 14. 18
# 15. less then a day
# 16. it depends on the issue time, in general, yes
# 17. yes
# 18. 4 hours ago
