"""ISSUES."""

# Алгоритм баг-репорта (взаимопомощь):
#
#
# 1. Заводим issues или смотрим issues коллеги (чат Git)
#
# 2. Если возможно решить в issues, то решаем там, иначе делаем fork
#
# 3. Если вопрос связан с файлом, коллега должен предоставить в issues файл с
# ошибками (зааттачить) и попросить путь к файлу в репозитории
#
# 4. Проверить, что в описании в issues есть версия интерпретатора и что он
# совпадает с моей версией, иначе будет диссонанс (Python 3.9 и тд)
#
# 5. Пишем в комментарии "Приняла в работу" и кидаем в reply ссылку на
# свой ответ
#
# 6. Отправляем pull request и кидаем ссылку в гит на pull request
#
# 7. Кидаем в телегу @ на человека и "Прими пулл"

# ![image.png](attachment:image.png)

# Важно подтянуть ветку
#
# ![image.png](attachment:image.png)

# Перед этим нужно сделать discard, чтобы убрать расхождения
# И можно проверить по коммитам актуальность
#
# ![image.png](attachment:image.png)
