"""Как работать с коммитами."""

# ## Список вопросов и ответов:
#
# 1. Опишите своими словами назначение каждого из этих типов коммитов: 
# feat, fix, docs, style, refactor, test, build, ci, perf, chore. 
#
#  - feat - добавили фичу. 
#  - fix - исправили баг. 
#  - docs - изменения только в документации. 
#  - style - внесли изменения, не влияющие на смысл кода (поставили/удалили пробел, точку, точку с запятой и т.д.). 
#  - refactor - рефакторинг кода, например переименование функции или переменной. 
#  - test - добавили/обновили тесты. 
#  - build - изменили сборку или изменили внешние зависимости для сборки. 
#  - ci - изменения в файлах конфигурации, скриптах сборки, обновление или настройка инструментов и зависимостей для непрерывной интеграции. 
#  - perf - изменение, которое повысило производительность кода. 
#  - chore - коммиты, которые не влияют на производительность и функциональность кода, они не связаны с исправлениями, а больше связаны с административными и рутинными задачами. 
#
# 2. Представьте, что вы исправили баг в функции, которая некорректно округляет числа. Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits (используя тип fix). 
#
# fix(round): correct number rounding
#
# 3. Добавление новой функциональности: 
# Допустим, вы реализовали новую функцию generateReport в проекте. Сделайте фиктивный коммит с типом feat, отражающий добавление этой функциональности 
#
# feat: add generateReport function 
#
# Automatically generate report with your data. 
#
# 4. Модификация формата кода или стилей: 
# Представьте, что вы поправили отступы и форматирование во всём проекте, не меняя логики кода. Сделайте фиктивный коммит с типом style 
#
# style: fixed indentation and formatting throughout the project
#
# 5. Документация и тестирование: 
#
# Сделайте фиктивный коммит с типом docs, добавляющий или улучшающий документацию для вашей новой функции. 
#
# docs: added documentation for generateReport function 
#
# Сделайте фиктивный коммит с типом test, добавляющий тесты для этой же функции. 
#
# test: created unit tests for generateReport function 
