"""Task commits."""

# 1. Опишите своими словами назначение каждого
#  из этих типов коммитов:

# - feat - добавляет новую фичу в код
# - fix - исправляет баг в коде
# - docs - такой нужен в случае, если изменения только в документации
# - style - не влияет на сам код (пробелы, точки с запятой и т.д)
# - refactor - помогает сделать код чище, т.е не влияет на фичи и
# - не чинит баг. Но делает код более читабельным и  понятным.
# - test - добавляет тесты или исправляет существующие
# - build - влияет на систему сборки или внешние зависимости
# - ci - добавляет изменения в файлах конфигурации CI и скриптах.
# То есть настраивает изменение процессов
# сборки, тестирования и деплоя.
# - perf - улучшается производительность
# - chore - нужен для технического обслуживания проекта
#  ( модифицирование и обновление зависимостей)

# 2) git commit -m "fix: rounding error in round function
# Now it correctly rounds numbers"
#
#
#
