"""[TASK] Commits #21."""

# Соглашение о коммитах:
#
# https://www.conventionalcommits.org/ru/v1.0.0/
#
# ![image.png](attachment:image.png)
#
# Опишите своими словами назначение каждого из этих типов коммитов:
# feat (feature) — добавление нового функционала в проект.
# fix — исправление багов, указывает на устранение ошибок.
# docs — исправление документации.
# style — были внесены изменения в формат кода.
# refactor — изменения в коде, улучшающих его структуру.
# test — для добавления или изменения тестов.
# build — для обновления настроек сборки или добавления новых пакетов.
# ci — для изменений в конфигурации или сценариях CI/CD.
# perf — для улучшений производительности приложения.
# chore — для мелких задач или изменений, не влияющих на функциональность.
#
# Представьте, что вы исправили баг в функции, которая некорректно округляет числа. Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits
# (используя тип fix).
#
# fix: resolve bug in number rounding function
#
# Добавление новой функциональности:
# Допустим, вы реализовали новую функцию generateReport в проекте. Сделайте фиктивный коммит с типом feat, отражающий добавление этой функциональности
# feat: add generateReport function
#
# Модификация формата кода или стилей:
# Представьте, что вы поправили отступы и форматирование во всём проекте, не меняя логики кода. Сделайте фиктивный коммит с типом style
# style: fix indentation and code formatting
#
# Документация и тестирование:
#
# Сделайте фиктивный коммит с типом docs, добавляющий или улучшающий документацию для вашей новой функции.
# docs: add new documentation
#
# Сделайте фиктивный коммит с типом test, добавляющий тесты для этой же функции.
# test: add new test for the function
#
