"""Commit Agreement."""

# Соглашение о коммитах - соглашение о том как необходимо писать сообщения для коммитов. Набор правил для создании  понятной истории коммтов.
#
# Ниже будут приведены то как необходимо структурировать ваши сообщения в зависимости от того что вы сделали в своем коде:

# #### Основные комманды 
#
# fix - исправление бага
#
# feat - добавление новой функции в коде
#
# BREAKING CHANGE - коммит нарушает совместимость кода
#
# ! - для привлечения внимания к BREAKING CHANGE
#
# docs - изменение только в документации
#
# test - добавление теса или исправляет существующие
#
# build - изменение кода которая влияет на систему сборки или архитектуру
#
# ci - изменения в файлах конфигурации CI.
#
# perf - улучшение производительности 
#
# chore - техническое обслуживание проекта (обновление зависимостей)
#

# #### Примеры
#
# #### Сообщение коммита с описанием и сноской BREAKING CHANGE
#
# feat: allow provided config object to extend other configs
#
# BREAKING CHANGE: `extends` key in config file is now used for extending other config files

# #### Сообщение коммита с ! для привлечения внимания к BREAKING CHANGE
#
# feat!: send an email to the customer when a product is shipped

# #### Сообщение коммита вместе с ! и сноской BREAKING CHANGE
# chore!: drop support for Node 6
#
# BREAKING CHANGE: use JavaScript features not available in Node 6.

# #### Сообщение коммита без тела
#
# docs: correct spelling of CHANGELOG

# #### Сообщение коммита с контекстом
#
# feat(lang): add polish language

# #### Сообщение коммита с телом из нескольких абзацев и несколькими сносками
#
# fix: prevent racing of requests
#
# Introduce a request id and a reference to latest request. Dismiss
# incoming responses other than from latest request.
#
# Remove timeouts which were used to mitigate the racing issue but are
# obsolete now.
#
# Reviewed-by: Z
# Refs: #123

# ### Спецификация
#
# Коммиты должны (MUST) начинается с типа, который является существительным: feat, fix и т.д. За ним следует необязательный (OPTIONAL) контекст, необязательный (OPTIONAL) восклицательный знак (!) и обязательные (REQUIRED) двоеточие (:) и пробел ( ).
#
# Тип feat - MUST
# Тип fix - MUST

# #### Зачем использовать «Соглашение о коммитах»
#
# Автоматическое создание списков изменения.
#
# Автоматическое определение семантического повышения версии 
#
# Информирование товарищей по команде, общественности и других заинтересованных сторон о характере изменений.
#
# Запуск процессов сборки и публикации.
#
# Упрощать людям участие в ваших проектах, позволив им изучить более структурированную историю коммитов. 

# ### Далее я сделаю пару коммитов для практики 

# Первый коммит - исправление бага в функции, которая некорректно округляет числа 

# Второй коммит - реализовал новую функцию generateReport в проекте.

# Третий коммит - поправил отступы и форматирование во всём проекте, не меняя логики кода.

# Четвертый коммит - добавил или улучшил документацию для новой функции

# Пятый коммит - добавил тесты для функции generateReport

# Последний коммит которые закрывает issues
