"""Task CPython and PyPy."""

# ### 1. Что такое CPython и чем он отличается от Python?
#
# - CPython это распространенная реализация языка
#  Python.Реализация написана на C и
#  Python и является самой широко используемой
#  и поставляется по умолчанию при установке Python.

# ### 2. Сколько существует реализаций Python, и какая из них самая популярная?
#
# Существует 6 реализаций Python:
#
# - CPython
#
# - PyPy
#
# - Jython
#
# - IronPython
#
# - MicroPython
#
# - Stackless Python

# ### 3. На каком языке написан CPython?
# На Python и C. Ядро написано на C

# ### 4. (опционально) Кто создал CPython?
# Гвидо ван Россум

# ### 5. Почему Python считается быстрым, несмотря на то, что это интерпретируемый язык?
#
# Python считается быстрым для разработки
# благодаря его высокоуровневой структуре, которая делает
# код проще и быстрее в написании. Оптимизации
# в CPython, включая эффективные встроенные
# структуры данных, такие как списки и словари,
# а также использование сторонних библиотек
# (например, NumPy), которые выполняются
# на низкоуровневом языке C/C++,
# обеспечивают дополнительное ускорение.

# ### 7. Напишите путь к Интерпретатору CPython на вашем компьютере
# - C:\Users\Admin\AppData\Local\Programs\Python\Python313\python.exe

# ### 8. Что содержится в папке include в CPython?
# В папке Include CPython содержатся
# заголовочные файлы,
# предоставляющие интерфейсы C API для работы
# с интерпретатором Python, включая основные структуры
# и функции, поддержку встроенных объектов
# модули, обработку исключений,
# управление памятью, многопоточность
# и расширение Python на уровне C.

# ### 9. Где можно найти исходный код CPython дайте ссылку на репозиторий гитхаб
# https://github.com/python/cpython

# ### 10.(опционально) Как работает интерпретатор CPython
# ### при выполнении кода?
# Интерпретатор CPython компилирует Python-код
# в байт-код, который выполняется виртуальной машиной,
# управляя памятью и сборкой мусора для работы объектов.

# ### 11. Какая команда используется для запуска файла с помощью CPython?
# - python file.py

#
# ### 12. Можно ли запускать текстовые файлы через интерпретатор Python? Почему?
# Да, можно. Главное чтоб текстовый файл содержал код
# и его можно запустить. Пайтон игнорирует расширение,
# главное чтоб он смог прочитать код.
#

# ### 13. Как указать путь к интерпретатору и файлу для выполнения кода?
#

# C:\Users\Admin\AppData\Local\Programs\Python\
# Python313\python.exe пробел file.py

# ### 14. Чем PyPy отличается от CPython?
# Он быстрее и фокусируется на производительности.
# Отличается от CPython тем, что PyPy использует
# механизм Just-In-Time (JIT) компиляции, который
# компилирует код в машинный код во время
# выполнения, что ускоряет выполнение программ.

# ### 15. Почему PyPy не может использоваться для всех
# ### проектов на Python?
# - Он довольно таки новый интерпретатор, и не часто используется из-за этого.

# 17. Как установить PyPy после скачивания?
# https://pypy.org/download.html
#  - устанавливаем на официальном сайте

# ### 18. Как запустить файл с помощью PyPy?
# C:\Users\Admin\Downloads\pypy3.10-v7.3.17-win64\pypy3.10-v7.3.17-win64 путь до exe + file.txt

# ### 19. Почему PyPy выполняет код быстрее, чем CPython?
# PyPy
# компилирует часто выполняемые участки кода
# в машинный код во время выполнения программы.
# A cpython интерпретирует байт-код на каждом шагу
# выполнения кода

# ## Практические задания
#

# Задание 1: Поиск и установка CPython
# - Установлена версия 3.13.0

# Задание 2: Исследование структуры CPython
# - Всего в папке include 77 файлов на C

# Задание 3: Запуск файла с помощью CPython
# - Выводится Hello from CPython!

# Задание 4: Установка и использование PyPy
# - Output : Hello from pypy!

# Задание 5: Сравнение производительности CPython и PyPy
#
# CPython:
# - Result: 49999995000000
# - Execution time: 1.0235819816589355 seconds
#
# PyPy:
# - Result: 49999995000000
# - Execution time: 0.07886266708374023 seconds
#
# ![image.png](attachment:image.png)
#

# Разница между интерпретаторами есть,и не малая
# PyPy быстрее Cpython в 12 раз!!!
