# 1. Что такое CPython и чем он отличается от Python?
# - CPython это распространенная реализация языка
# Python.Реализация написана на C и
# Python и является самой широко используемой
# и поставляется по умолчанию при установке Python.

# 2. Сколько существует реализаций Python, и какая из них самая популярная?
# Существует 6 реализаций Python:
# - CPython
# - PyPy
# - Jython
# - IronPython
# - MicroPython
# - Stackless Python

# 3. На каком языке написан CPython?
# На Python и C. Ядро написано на C
# ![image.png](attachment:image.png)

# 4. (опционально) Кто создал CPython?
# Гвидо ван Россум

# 5. Почему Python считается быстрым,
# несмотря на то, что это интерпретируемый язык?
#
# Python считается быстрым для разработки
# благодаря его высокоуровневой структуре, которая делает
# код проще и быстрее в написании. Оптимизации
# в CPython, включая эффективные встроенные
# структуры данных, такие как списки и словари,
# а также использование сторонних библиотек
# (например, NumPy), которые выполняются
# на низкоуровневом языке C/C++,
# обеспечивают дополнительное ускорение.

# 6. Напишите путь к Интерпретатору CPython на вашем компьютере
