"""Логирование уроков по GitHub."""

# 13.11.2024
# Stage changes - список который отслеживается Гитом (трекается) то есть этот список идет на комит, будет зафиксирован в комите.
# Changes - список модифицированных файлов которые не попали в комит.
# Комит не должен содержать все файлы.
# Файлы должны быть разбиты на несколько комитов.
# git status - зеленые файлы значит что файлы трекаются и находятся в списке stage changes
# три точки - можно включать и исключать файлы из комита
# красный файл - не трекается но он изменен
# git add . - добавить все файлы в комит
# сначала pull потом push
# две команды одновременно - fetch
#
