"""Конспект по первому уроку."""

#  Алгоритм принятия ДЗ
# 1. В чате HW  пишу прийми пул Заходим в кошку нажимаем Fetch origin
# ![image.png](attachment:image.png)

# 2. Открываем вкладку History  смотрим ДЗ
# ![image.png](attachment:image.png)

# 3. Выполняем команду pre-commit run --all-files Отдаем ДЗ зайти в кошку и заполнить Summary и нажать кнопку Commit to main (в данный момент изменения локально зафиксировались, но в интернете их нет и им присвоен номер коммита) Название комита должно отражать то, что я в нем сделала. Например, ДЗ 5
# ![image.png](attachment:image.png)
#

# 4. Нажимаем кнопку Push
# ![image.png](attachment:image.png)

# 5. Модуль - это файл с расширением .py или .ipynb

# 6. Linter - это инструмент анализа и поиска ошибок согласно PEP8.
# 7. Pylint и Flake8 - это линтер
# 8. mypy - это инструмент анализа статической типизации, аннотация типов.
# 9. Black  (shift+alt+f)- это инструмент автоформатирования кода согласно линтеру.
#
