"""learning_more_to_understand_python."""

# KEYBOARD SHORTCUTS
# Shift Alt F  - это форматирование текста, beautiful Text

# Каждый файл Юпитера / ipynb это json.
# Это обычный формат файла в интернете для передачи данных между клиент сервером.
# Клиент (это браузер) сервер (компьютер расположенный где угодно это не только железо но и компьютерная программа) - это обычное

# В Питоне все является **объектом**.
# У каждого обьекта есть методы.
# Метод - это обычная функция в которой надо ставить круглые скобочки.
# Методы можно посмотреть через команду **dir()**  dir(str)
# Методы обьекта вызываются через точку.
# Мы испробовали методы изменения буквенного регистра .upper и .lower.

# показывает атрибуты (переменная) и методы (функции) обьекта
dir(str)

"chapter_1_Introduction_to_Data_Science_and_Programming_Basics.ipynb".lower()

"chapter_1_Introduction_to_DS_and_Programming_Basics.ipynb".upper()

# Все зеленого цвета с круглыми скобочками - создание обьекта.
# Все зеленого цвета без круглых скобочек - имя класса.
# Все желтого цвета - функция.

# Знак ? - это сигнатура, описание обьекта, его параметров.

# +
# int?
# -

# <p>CPython - это эталонная реализации языка Питон написанная на Си. Тот Пайтон который мы используем. И это же одновременно является интерпритатором.</p>

help()
# аналог сигнатуры для разработчиков

# <p>https - защищенный протокол передачи данных </p><br>
# питоновский словарь можно преобразовать в json
# строка url пакуется в json
# на сервере мы преобразуем json в словарь
#

# <p>https://api.telegram.org/bot7356865912:AAF1QT-_VOCEVv7tZAUxkNC8OkEJKQoObjA/sendMessage?chat_id=730302082&text=senatorov</p>
