"""traceback_debug."""

# трассировка - последовательный список ошибок, которые вываливаются
# Сначала ищем путь к поломанному файлу самый нижний файл ломает
# выделен синим
# через запятую указана строка поломки
# красным
# потом указано место где ошибка
# птички указывают место критической ошибки
# там где стрелка написано что жде меня в качестве параметра, причина ошибки
# output.stdout.decode('utf-8')

# ![image.png](attachment:image.png)

# открыть win+r

# ![image.png](attachment:image.png)

# Заходим в терминал через команду cmd находясь в папке в которой установлен файл precomit
# В терминале команда code .

# ![image.png](attachment:image.png)

# ![image.png](attachment:image.png)

# ![image.png](attachment:image.png)

# заходим в терминал VS code
# команда cd .. - поднятся наверх на один уровень (одну папку)
# команда cd + first letter folder - переход на уровень выше
#
