"""modul_1_research_and_analysis."""

# <h1>1. Базовые подходы к анализу бизнеса.</h1>
#
# <p> <b>Рынок- это процесс непрерывного взаимодействия между продавцами товаров и услуг и потребителями.</b></p>
# <p>**Анализ рынка** - это исследование параметров их отношений. Продавать что? Продавать как? Продавать кому?</p>
#
# <p> Для чего делают анализ рынка:</p>
# 1. Узнать потребителя - целевая аудитория.</p>
# 2. Разработать стратегию развития.</p>
# 3. Скорректировать стратегию развития.</p>
# 4. Для запуска проекта.</p>
# 5. Выйти на новый уровень дохода.</p>
#
# <p>Наша задача: дать трезвую оценку продукта и проекта.</p>
#
# <p>Основные моменты:</p>
# 1. изучить как потребители выбирают товар (услугу), на что обращают внимание.</p>
# 2. найти свободные ниши и выгодныен каналы продаж</p>
# 3. Выявить достоинства и недостатки товаров.</p>
# 4. Сформулировать конкурентные преимущества.</p>
# 5. Наметить стратегию продвижения.</p>
#
# <p>Конечная цель анализа - соединение востребованных продуктов и увеличение прибыли.</p>
#
# <p>Виды исследований:</p>
# 1. Маркетинговое. Для действующего бизнеса.</p>
# 2. Комплексное. Для запуска нового проекта.</p>
# 3. Качественное. Субьективная оценка для формирования гипотезы.</p>
# 4. Количественное.Основывается на количественных величинах. Статистика.</p>
#
# <p>Основные этапы анализа рынка</p>
# <p>Изучите отрасль и ее перспективы: продукт+динамика+препятствия для развития+направления роста</p>
# <p>Соберите информацию о целевой аудитории какую боль закрывает потребитель продуктов, кто ваш клиент: статистика собственная, статистика конкурентов, опрос клиентов</p>
# <p>Исследуйте конкурентов. Конкуренция может быть прямая, косвенная, потенциальная.</p>
# <p>Анализ возможностей рынка. SWOT-анализ. S - сильные стороны, W - слабые моменты, над которыми следует поработать, O - возможности развития, T - угрозы и риски, которые нужно учитывать и по возможности утсранять. SWOT-анализ помогает объективно оценить перспективы бизнеса, найти пути улучшения и точки роста.</p>
# <p>Структурируйте данные. Графики и диаграммы - для статистики, социально-демографических характеристик, уровня удовлетворенности целевой аудитории. Майнд-карты - для структуры рынка, стратегии развития, плана подготовки. Таблицы Ecxel и Googl Sheets - универсальная систематизация количественных и качественных данных.</p>
#
# <p>Основные ошибки анализа: игнорирование потребностей ЦА, некачественное тизучение деятельности конкурентов, недостаточный поиск перспектив.</p>
#
# <p>Главное в анализе: продукт + клиенты(поиск. выявление истинной потребности) + конкуренты!!!</p>

# <h1>2. Жизненный цикл продукта.</h1>
#
# <p> Это необходимо для понимания почему некоторые продукты популярны всегда, дляительное время (кока кола) а некоторые быстро утрачивают популярность</p>
#
# <p> Жизненный цикл продукта - это инструмент управления, позволяющий анализировать поведение продукта с момента его разработки до вывода с рынка. Он охватывает все стадии роста, от запуска до принятия и зрелости продаж.</p>
#
# <p>Теодор Леввит. Концепция жизненного цикла товаров: Разработка -> Внедрение -> Рост -> Зрелость -> Упадок.</p>
#
# [![image-18.jpg](attachment:image-18.jpg)](path/to/file.md)
#
# <p>Фаза 1. Разработка жизненного цикла продукта:
# 1. Анализ рынка.
# 2. Уникальное торговое предложение.
# 3. Гипотезы.
# 4. Технология производства.
# 5. Тестирование прототипа.</p>
#
# <p>Фаза 2. Выход на рынок.
# Готовый товар.
# Прототип.
# Мелкие партии либо предпродажи.
# Запуск маркетинга.
# Анализ продукта и спроса.</p>
#
# <p>Фаза 3. Рост.
# Завоевывание рынка.
# Лояльность аудитории.
# Повторные продажи.
# Усиление маркетинга, так как в это время активизируются конкуренты.
# Рост продаж.</p>
#
# <p>Фаза 4. Зрелость.
# Это пик и высшая точка цикла. Именно тогда продукт достигает своего максимального потенциала, а продажи начинают стабилизироваться. Анализ конкурентов, анализ продаж, активизация маркетинга.
# Задача на данном этапе - поддерживать хорошие результаты и продолжать опережать своих конкурентов.</p>
#
# <p>Фаза 5. Упадок.
# Итерес к продукту угасает.
# Появляются более технологичные идли мождные товары.
# Заинтересованные клиенты приобрели продукт и не планируют повторных покупок. рынок насыщен.
# Прибыль падает, компания оставляет в продаже только прибыльные и топовые позиции.
# Снижается рекламная активность, оптимизируются издержки.</p>
#
# <p>Что делать чтобы продлить жизненный цикл продукта. На этапе зрелости!
# 1. Улучшить характеритстики. Добавить новые функции, использовать современные материалы, повысить качество.
# 2. Обновить дизайн. Сделать более удобный интерфейс, обновить упаковку или внешний вид самого товара.
# 3. Привлечь новую аудиторию. найти новый сегмент.
# 4. Сменить позиционирование.
# 5. Изменить стоимость.</p>
#
# <p>Внедрение на рынок.
# Продукт. Важно собиратьобратную связь от потребителей, что  бы при необходимости доработать продукт.
# Цена. Используют одну из стратегий. "Снятие сливок" - высокая стоимость на уникальный товар, который не имеет аналогов и в короткие сроки окупает вложения. "Быстрый вход" - низкая цена, чтобы быстро охватить ЦА и завоевать большую долю рынка.
# Маркетинг. Затраты на рекламу высокие. Задача - увеличить узнаваемость и осведомленность о продукте.
# Реализация. развита слабо. Оычно товар представлен в сеттях и на платформах с низким порогом входа.</p>
#
# <p>Рост продаж.
# Компания работает над улучшением качества и функционала, расширяет ассортимент и модельный ряд, в том числе предлагает бюджетные варианты товара.
# Стоимость становится инструментом конкурентной борьбы. Производитель может снижать цену, предложить клиентам акции, скидки.
# Необходимо увеличивать охваты, формировать лояльность, стимулировать повторные покупки.
# Максимальная доступность товара для потребителя. Компания использует все офлайн и онлайн каналы сбыта, предлагает акции для дистрибьютеров.</p>
#
# <p>Зрелость.
# Улучшение качества товаров может приветси к повторному циклу роста. на рынок выводят альтернативные версии продукта, например, ограниченную серию вкусов или технический дизайн.
# Цена сохраняется на стабильном уровне, ситуативно используют акции и скидки.
# Поиск новых реынков и ниш. Компания сохраняет лояльных клиентов, переманивает новую аудиторию у конкурентов.
# Необходимо поддерживать максимальную доступность товара.</p>
#
# <p>Спад продаж.
# Чтобы вернуться на этап роста, нужно обновить продукт, добавить принципиально новые характеристики и качества. Второй подход - отказаться от продукта или оставить в производстве наиболее популярную и прибыльную модель.
# Снижение стоимости помогает удержать лояльную консервативную аудиторию, которая все еще покупает продукт.
# Рекламный бюджет оптимизируется. Основная задача - поддерживать интерес лояльной аудитории.
# каналы дитрибуции сокразаются, остаются самые эффективные и недорогие.</p>

# <h1>3. Анализ рынка. Проблемы и ограничения.</h1>
# <p><b>Ошибки при анализе рынка.</b>
# <p>1. Использовать недостоверные данные. Надо использовать данные только из проверенных источников: Росстат, отраслевые обзоры РБК и Коммерсанта, аналитические обзоры профильных объединений, доклады экспертов и т.п.</p>
# <p>2. Использовать неактуальные данные. </p>
# <p>3. Недостаточно глубоко погружаться в исследование. Из-за непонимания того, какой объем данных нужо проанализировать. Минимум 10 источников!!!</p>
# <p>4. Вести подсчеты только по одному показателю. Деньги или люди или штуки или...</p>
# <p>5. Низкий уровень ответов. Кастдев, опрос удовлетворенности и т.п. Когда клиент не заинтересован в опросе. Опрос должен быть простым и удобным.</p>
# <p>6. Предвзятая выборка. Для смягчения этого фактора брать разные группы и слои.</p>
# <p>7. Высокие затраты. Важно дополнительно в анализе рынка включить все альтернативы по каналам продаж, платформы и социальные сети, коллаборация с другими организациями.</p>
# <p>8. Неточные данные. Для устранения необходимы проверочные вопросы. Возможно пилотное тестирование. </p>

# <h1>4. Источники данных. инструменты поиска.</h1>
# <p><b>Яндекс.Взгляд, SurveyMonkey, Googl формы, Typeform </b></p>
# <p>- внедрение анкеты в продукт (регистрация и .т.д.),</p>
# <p>- реклама и поиск респондентов для анкеты,</p>
# <p>- создание программируемой анкеты с прописанным сценарием показа вопросов.</p>
#
# <p>В имеющийся сайт компании можно встроить сервисы анализа посещаемости сайта и анализа поведения на сайте. Яндекс.Метрика и Google Analytics для наблюдения за поведением клиента на сайте.</p>
# <p>Аналитика соцсетей. Обычно есть встроенные сервисы в сами сети.</p>
#
# <p>Аналитика для мобильных приложений. </p>
# <p>Два варианта:</p>
# <p>1. Firbase Analytics.</p>
# <p>2. Amplitude.</p>
# <p>3. Эпсфлаер.</p>
#
# <p><b>Наиболее распространенные источники бизнес-информации:</b>
# <p>- интернет ресурсы</p>
# <p>- правительственные учреждения</p>
# <p>- библиотеки</p>
# <p>- торговые ассоциации и фонды, Финам к примеру</p>
# <p>- компании, занимающиеся частными исследованиями и информацией</p>
# <p>- СМИ</p>
# <p>- службы бизнес-информации, рейтинговые агентства, академические учреждения (РАНГХИКС)</p>
# <p>- базы данных в режиме он-лайн</p>
#

# <h1>5. Критическое мышление. Поиск по соц. сетям. </h1>
# <p>Критическое мышление - один из ключевых навыков 21 века.</p>
# <p>Перечень навыков, указывающих на наличие критического мышления. # Весьма субьективно, на мой взгляд.</p>
# <p>Человек обладающий критическим мышлением.Перечень характеристик.</p>
# <p>Способы развития и примеры критического мышления.</p>
# <p>1. Обогащайте багаж знаний.</p>
# <p>2. Формулируйте вопросы. ДЗ Задание список 50 вопросов на одну тему.</p>
# <p>3. Изучайте и анализируйте.</p>
# <p>4. Используйте альтернативные источники информации.</p>
# <p>5. Придумывайте варианты.</p>
# <p>6. Анализируйте ошибки.</p>

# ## 6. Практические кейсы.

#

# 7. **Оценка рынка сверху вниз и снизу вверх.**
# <p></p>

#
