"""practical_work_modul_first."""

# Написать список из 50 вопросов по данной теме
# 1. какая боль у предпринимателя в этом аспекте
# 2. зачем ему нужно мобильное приложение
# 3. какие аспекты КДО закроет мобильное приложение
# 4. Сколько сейчас тратится денег ежемесячно, ежегодно. Сколько будет стоить МП?
# 5. Зачем предприниматели переходят на электронно КДО

# Тема: Рыночный анализ в сфере бизнес-аналитики.
#
# Данную проектную работу необходимо выполнять в течении всего модуля, желательная дата сдачи - до даты Вебинара по модулю №1 "Исследование и анализ""
#
# Задача
# В данном домашнем задании вашей целью является проведение глубокого анализа рынка в области бизнес-аналитики. Выберите сферу деятельности, информация о которой легко доступна в открытых источниках, чтобы упростить проведение исследования.
#
# Шаги выполнения
#
# <p>1. Выбор сферы деятельности:</p>
#
# <p>Информационные технологии и разработка программного обеспечения.</p>
# <p>Исследование и разработка искусственного интеллекта.</p>
#
# 1. Исследование рынка:
# Обзор общей ситуации на рынке: Изучите текущую ситуацию в выбранной сфере с использованием открытых источников и статистических данных.
# Определение крупнейших игроков: Выявите крупнейшие компании в выбранной сфере и опишите их ключевые характеристики.
# Методы поиска информации: Используйте интернет-ресурсы, отчеты компаний, а также статистические публикации для получения данных.
#
# 1. Анализ рынка:
# Качественный анализ: Примените качественные методы анализа, такие как SWOT-анализ, для понимания текущего состояния рынка.
# Задачи рынка и тренды: Проанализируйте основные задачи, перед которыми стоит рынок, и выделите текущие тренды.
#
# 1. Прогноз развития рынка:
# Оценка перспектив рынка: Предположите, как будет развиваться рынок в ближайшем будущем.
# Рентабельность бизнеса: Сделайте выводы о рентабельности запуска нового бизнеса в данной сфере, основываясь на текущих данных.
#
# 1. Целевой продукт:
# <p>Мобильное приложение
# Определение продукта: Выберите продукт или услугу, который могла бы предоставлять ваша "воображаемая компания".
#
# Обоснование выбора продукта: Обоснуйте, почему выбранный продукт может быть востребован на рынке, и как он соотносится с текущими трендами.
#
