"""Теория вероятности. Задачи."""

# # Задачи на классическое определение вероятности
#
# ## Задача 1. Лотерея
#
# Условие:
# В лотерее разыгрывается 3 книги. Всего в урне 50 билетов. 
# Первый подошедший к урне вынимает билет. 
# Найти вероятность того, что билет окажется выигрышным.
#
# Решение:
# По формуле классической вероятности P(A) = m/n, где:
# n = 50 (общее число билетов) - число элементарных исходов
# m = 3 (число выигрышных билетов) - число благоприятных исходов
#
# P(A) = m/n = 3/50 = 0.06 = 6%
#
# Ответ: вероятность выигрыша составляет 6%
#
#
# ## Задача 2. Секретный замок
#
# Условие:
# Секретный замок содержит 15 дисков. Каждый диск имеет десять цифр от 0 до 9.
# Какова вероятность открыть замок, случайно набрав комбинацию из 15 цифр?
#
# Решение:
# По формуле классической вероятности P(A) = m/n, где:
# n = 10^15 (все возможные комбинации) - число элементарных исходов
#    (10 вариантов для каждого из 15 дисков)
# m = 1 (правильная комбинация) - число благоприятных исходов
#
# P(A) = m/n = 1/10^15
#
# Ответ: вероятность открыть замок составляет 1/10^15
#
#
# ## Задача 3. Игральные кости
#
# Условие:
# Брошено 8 игральных костей. 
# Найти вероятность того, что на всех выпавших гранях появится одинаковое число очков.
#
# Решение:
# По формуле классической вероятности P(A) = m/n, где:
# n = 6^8 (все возможные комбинации выпадения 8 костей) - число элементарных исходов
#    (6 вариантов для каждой из 8 костей)
# m = 6 (возможные варианты одинаковых чисел от 1 до 6) - число благоприятных исходов
#
# P(A) = m/n = 6/6^8 = 6/(6^8) = 1/6^7 ≈ 1/262144
#
# Ответ: вероятность выпадения одинаковых чисел составляет примерно 0.0000038 или 1/262144
#

# # Задачи на теоремы сложения и умножения вероятностей
#
# ## Задача 1. 
#
# Условие: Для сигнализации об аварии установлены два независимо работающих сигнализатора. Вероятность того, что при аварии сигнализатор сработает, равна 0,95 для первого сигнализатора и 0,9 для второго. Найти вероятности того, что: а) при аварии сработает только один сигнализатор; б) сработает хотя бы один сигнализатор
#
# Решение:
#
# Найдем противоположные события:
# p₁ = 0.95 (вероятность срабатывания первого сигнализатора)
# q₁ = 1 - 0.95 = 0.05 (вероятность НЕсрабатывания первого сигнализатора)
# p₂ = 0.90 (вероятность срабатывания второго сигнализатора)
# q₂ = 1 - 0.90 = 0.10 (вероятность НЕсрабатывания второго сигнализатора)
#
# События называются независимыми, если наступление одного не влияет на вероятность наступления другого.
# События называются несовместными, если они не могут произойти одновременно в одном испытании.
# В задаче сигнализаторы работают независимо друг от друга. Значит это независимые события.
#
# Применяем  две теоремы.
# Теорема умножения для независимых событий P(A × B) = P(A) × P(B).
# Теорема сложения для несовместных событий P(A + B) = P(A) + P(B).
#
# а) Найдем вероятность того, что при аварии сработает только один сигнализатор. 
#
# P(A) = P(p₁) × P(q₂) + P(p₂) × P(q₁) = 0.95 × 0.10 + 0.05 × 0.90 = 0.095 + 0.045 = 0.14
#
# б) Найдем вероятность того, что при аварии сработает хотя бы один сигнализатор. 
# Первый способ решения:
# "Хотя бы один" включает в себя три случая:
# Сработал только первый -  P(p₁) × P(q₂)
# Сработал только второй -  P(p₂) × P(q₁)
# Сработали оба -  P(p₁) × P(p₂)
#
# P(B) = P(p₁) × P(q₂) + P(p₂) × P(q₁) + P(p₁) × P(p₂) = 0.95 × 0.10 + 0.05 × 0.90 + 0.95 × 0.90 = 0.095 + 0.045 + 0.855 = 0.995
#
# Второй способ решения:
#
# Ни один + Хотя бы один = 1
#
# Сначала найдем вероятность того, что оба сигнализатора не сработают (ни один).
# P(C) = P(q₁) × P(q₂) = 0.05 × 0.10 = 0.005
# По теореме сложения для противоположных событий P(B) = 1 - P(C)
# P(B) = 1 - P(C) = 1 - 0.005 = 0.995
#
# Ответ:
# вероятность того, что при аварии сработает только один сигнализатор, составляет 0.14, 
# вероятность того, что сработает хотя бы один сигнализатор, составляет 0.995.
#
#
# ## Задача 2.
#
# Условие:
# Отдел технического контроля проверяет изделия на стандартность.
# Вероятность того, что изделие стандартно, равна 0,9. 
# Найти вероятность того, что из двух проверенных изделий: 
# а) только одно стандартное; 
# б) хотя бы одно стандартное.
#
# Решение:
# Пусть:
# p = 0.9 - вероятность того, что изделие стандартное
# q = 1 - p = 0.1 - вероятность того, что изделие нестандартное
#
# а) Вероятность того, что только одно стандартное:
#    По теореме сложения несовместных событий и умножения независимых событий:
#    P(только одно) = P(первое станд., второе нет) + P(первое нет, второе станд.)
#    P(только одно) = p × q + q × p = 0.9 × 0.1 + 0.1 × 0.9 = 0.18
#
# б) Вероятность того, что хотя бы одно стандартное:
#    Найдем через противоположное событие (оба нестандартные):
#    P(хотя бы одно) = 1 - P(оба нестандартные)
#    P(хотя бы одно) = 1 - q × q = 1 - 0.1 × 0.1 = 1 - 0.01 = 0.99
#
# Ответ: 
# а) вероятность того, что только одно изделие стандартное = 0.18 или 18%
# б) вероятность того, что хотя бы одно изделие стандартное = 0.99 или 99%
#
# ## Задача 3.
#
# Условие:
# Вероятность одного попадания в цель при одном залпе из двух орудий равна 0,38.
# Вероятность попадания вторым орудием p₂ = 0,8.
# Найти:
# 1. Вероятность поражения цели первым орудием (p₁)
# 2. Вероятность поражения цели хотя бы одним из орудий
#
# Решение:
# 1. Найдем вероятность попадания первым орудием (p₁):
#    
#    Вероятность одного попадания (только первое или только второе орудие):
#    P(одно попадание) = p₁q₂ + q₁p₂ = 0.38
#    где: 
#    q₂ = 1 - p₂ = 1 - 0.8 = 0.2 (вероятность промаха вторым орудием)
#    q₁ = 1 - p₁ (вероятность промаха первым орудием)
#
#    Подставляем:
#    p₁ × 0.2 + (1 - p₁) × 0.8 = 0.38
#    0.2p₁ + 0.8 - 0.8p₁ = 0.38
#    -0.6p₁ = -0.42
#    p₁ = 0.7
#
# 2. Найдем вероятность поражения цели хотя бы одним орудием:
#    
#    Через противоположное событие (промах обоими орудиями):
#    P(хотя бы одно) = 1 - P(ни одного)
#    P(хотя бы одно) = 1 - q₁ × q₂
#    P(хотя бы одно) = 1 - (0.3 × 0.2)
#    P(хотя бы одно) = 1 - 0.06 = 0.94
#
# Проверка:
# p₁ = 0.7 - реалистичное значение (0 ≤ p₁ ≤ 1)
# Итоговая вероятность 0.94 < 1
#
# Ответ:
# 1. Вероятность попадания первым орудием = 0.7 или 70%
# 2. Вероятность поражения цели хотя бы одним орудием = 0.94 или 94%
#
#
#

# # Задачи по комбинаторике
#
# ## Задача 1.
#
# Условие:
# В комнате имеется 6 лампочек, каждая со своим выключателем. Сколькими способами можно освещать комнату?
#
# Решение:
#
# Это задача на правило умножения, потому что мы имеем:
# Независимые действия (включение/выключение)
# Для каждого действия фиксированное число вариантов (2)
# Возможность повторения состояний
#
# 2 × 2 × 2 × 2 × 2 × 2 = 2⁶ = 64 способа
#
# Решение через сочетания:
# 1. Включена 0 лампочек: C⁰₆ = 1 способ
# 2. Включена 1 лампочка: C¹₆ = 6 способов
# 3. Включены 2 лампочки: C²₆ = 15 способов
# 4. Включены 3 лампочки: C³₆ = 20 способов
# 5. Включены 4 лампочки: C⁴₆ = 15 способов
# 6. Включены 5 лампочек: C⁵₆ = 6 способов
# 7. Включены 6 лампочек: C⁶₆ = 1 способ
#
# Всего: 1 + 6 + 15 + 20 + 15 + 6 + 1 = 64 способа
#
# Ответ: искомое число способов освещения комнаты = 64.
#
# ## Задача 2.
#
# Условие:
# Из группы, в которой учатся 20 человек, нужно выбрать двоих студентов
# для поездки на картошку. Сколькими способами это можно сделать?
#
# Решение:
#
# Используем формулу сочетаний C ᵏₙ = n!/k!(n-k)!, так как:
# - Выбираем ЧАСТЬ студентов (2 из 20)
# - Порядок НЕ ВАЖЕН (неважно кто первый, кто второй)
# - Повторений нет (один студент не может быть выбран дважды)
#
# C²₂₀ = 20!/2!(20-2)! = 20!/(2! × 18!) = (20 × 19)/(2 × 1) = 190
#
# Ответ: 190 способов
#
